{
  "id": 11123385,
  "name": "Figurine Of Wondrous Power (Basalt Dragon)",
  "tags": ["item", "wondrous_item", "slotless"],
  "cost": 60000.0,
  "weight": 1.0,
  "description": {
    "text": "Each of the several kinds of figurines of wondrous power appears to be a miniature statuette of a creature an inch or so high (with one exception). When the figurine is tossed down and the correct command word spoken, it becomes a living creature of normal size (except when noted otherwise below). The creature obeys and serves its owner. Unless stated otherwise, the creature understands Common but does not speak.\nIf a figurine of wondrous power is broken or destroyed in its statuette form, it is forever ruined. All magic is lost, its power departed. If slain in animal form, the figurine simply reverts to a statuette that can be used again at a later time.\nSilver Raven: This silver figurine turns into a raven on command (but it retains its metallic consistency, which gives it hardness 10). Another command sends it off into the air, bearing a message just like a creature affected by an animal messenger spell. If not commanded to carry a message, the raven obeys the commands of its owner, although it has no special powers or telepathic abilities. It can maintain its nonfigurine status for only 24 hours per week, but the duration need not be continuous.; CL 6th; Craft Wondrous Item, animal messenger, animate objects.\nCoral Hippocampus: When animated, this figurine of wondrous power (Core Rulebook 513) acts in all ways like a normal combat-trained hippocampus (Bestiary 2 155). The item can be used three times per week for up to 12 hours per use. When 12 hours have passed or when the command word is spoken, the coral hippocampus again becomes a tiny statuette.; CL 19th; Craft Wondrous Item, animate objects.\nEmerald Frog: This figurine of wondrous power appears as a small, innocuous frog carved of cloudy emerald. On command, it transforms into either a giant frog with the advanced template or 3 poisonous frogs—the user makes this choice at the time of activation. The frog (or frogs) can be animated up to 3 times per week, for a maximum total duration of 12 hours per week. If the advanced giant frog is slain, the emerald frog cannot be activated again for 1 full week. Each poisonous frog that is slain in combat reduces the total duration that the figurine can be activated for the week by 4 hours.\nEither the giant frog or the poisonous frogs can be used as combatants or as small, unintelligent servant-creatures, performing minor tasks or fetching small objects. The giant frog can be used by Small or smaller creatures as a makeshift mount, although it is not equipped with a saddle or similar equipment, and its slick hide imposes an additional –4 penalty on Ride attempts.; CL 8th; Craft Wondrous Item, animate objects.\nLapis Camel: This palm-sized camel figurine is sculpted of lapis lazuli. When you throw the lapis camel to the ground and speak the command word, it turns into a dromedary camel. The camel acts as a normal camel in all respects, except that it obeys your verbal commands to the best of its animal-level intelligence. At your command, the camel returns to its figurine form. The lapis camel can be used up to 3 times per week for up 8 hours each use.; CL 11th; Craft Wondrous Item, animate object.\nPearl Dolphin: This 2-inch-long pearl figurine turns into a dolphin on command (but it retains its composition, which gives it hardness 10). The dolphin follows the verbal commands of the creature who spoke the command word and will follow commands as a summoned creature. With a second command word, the dolphin will swim to an indicated location at double its swim speed, bearing a message just like a creature affected by an animal messenger spell.\nThe pearl dolphin can maintain its nonfigurine status for only 24 hours per week. The duration need not be continuous, but it must be used in 1-hour increments.; CL 11th; Craft Wondrous Item, animal messenger, animate objects.\nRuby Butterfly: Upon command, this figurine of wondrous power transforms into a hand-sized red butterfly (same statistics as a bat). A spellcaster can use a ruby butterfly to deliver touch spells, as if the ruby butterfly were a familiar capable of this ability. A ruby butterfly can also be commanded to guard its owner while he sleeps. Creatures protected this way gain a +5 luck bonus on saving throws against any spell or effect that affects sleeping creatures\u0027 dreams (such as nightmare or a night hag\u0027s dream haunting ability). A ruby butterfly can be used three times per week for up to 8 hours at a time.; CL 9th; Craft Wondrous Item, animate object, dream.\nBlack Jade Raven: This fist-sized piece of black jade is exquisitely tooled into the shape of a raven with outstretched wings. Upon command, it transforms into a black raven (use the stats for an eagle) or a giant black raven (use the stats for a giant eagle). Both forms of the raven have Improved Steal as a bonus feat. The raven understands Common but cannot speak. It can answer questions related to its abilities or what it has seen by cawing once for \"yes\" and twice for \"no.\"\nThe raven can maintain its non-figurine status for only 24 hours per week. This duration need not be continuous, but it must be used in 1-hour increments. After three transformations into its giant raven form (though not its smaller version), the statuette loses all magical properties.; CL 11th; Craft Wondrous Item, animate objects.\nSerpentine Eagle: This Andoren variant of the serpentine owl can be transformed into an eagle or giant eagle but is otherwise identical to the owl figurine. Serpentine eagles are popular among Eagle Knights for scouting and emergency transportation.; CL 11th; Craft Wondrous Item, animate objects.\nSerpentine Owl: This figurine becomes either a normal-sized horned owl or a giant owl (use the stats for the giant eagle) according to the command word used. The transformation can take place once per day, with a maximum duration of 8 continuous hours. However, after three transformations into giant owl form, the statuette loses all its magical properties. The owl communicates with its owner by telepathic means, informing her of all it sees and hears.; CL 11th; Craft Wondrous Item, animate objects.\nBronze Griffon: When animated, a bronze griffon acts in all ways like a normal griffon under the command of its possessor. The item can be used twice per week for up to 6 hours per use. When 6 hours have passed or when the command word is spoken, the bronze griffon once again becomes a tiny statuette.; CL 11th; Craft Wondrous Item, animate objects.\nEbony Fly: When animated, an ebony fly is the size of a pony and has all the statistics of a pegasus but can make no attacks. The item can be used three times per week for up to 12 hours per use. When 12 hours have passed or when the command word is spoken, the ebony fly again becomes a tiny statuette.; CL 11th; Craft Wondrous Item, animate objects.\nHematite Courgar: This palm-sized figurine of a cat with a spiked tail is made of gleaming hematite. A hematite cougar turns into a digmaul (Pathfinder RPG Bestiary 5 82) that is fully obedient to the figurine\u0027s owner. Even in its animated form, the hematite cougar is made of dense metal, granting it a +2 armor bonus to AC and a +2 bonus to its CMD. An animated hematite cougar conducts low levels of electricity; creatures adjacent to the hematite cougar gain electricity resistance 2, but any damage prevented by this ability is dealt to the hematite cougar instead. A hematite cougar can be animated twice per week for up to 8 hours per use; speaking the command word before the 8 hours expires returns the hematite cougar to a figurine.; CL 11th; Craft Wondrous Item, animate objects, resist energy.\nSlate Spider: This statuette of a spider with stubby legs can be used once per day for 1 minute. When activated, the figurine sprouts longer, segmented legs, and scampers about the bearer, picking lint off robes, chiseling grime from armor, or otherwise grooming the bearer. If commanded to do so (a free action), it perches on the muzzle of a one-handed or two-handed firearm barrel and, after the firearm is fired, travels down the barrel and cleans out the firearm. Each time the slate spider cleans a firearm, the next shot the firearm fires has no chance of misfiring.; CL 11th; Craft Wondrous Item, animate objects.\nTin Imp: These fat, smirking imp figurines are made of solid tin. A tin imp turns into an imp (Pathfinder RPG Bestiary 78) on command, though it retains its metallic consistency, which gives it a +4 armor bonus to AC. In imp form, a tin imp can turn invisible at will as a swift action, though it retains none of an imp\u0027s other spelllike abilities and lacks a poisoned sting. Tin imps generally avoid combat, but make excellent spies and trackers.\nThe tin imp\u0027s owner can, as a move action, designate a single creature in his line of sight as the tin imp\u0027s quarry. The tin imp then follows its quarry clandestinely, and sends a whispered message to its owner once each hour detailing the quarry\u0027s location and activities. The message is similar to the whispering wind spell, though the message unerringly locates the tin imp\u0027s owner instead of moving to a predetermined location. A tin imp can maintain its animate status for up to 48 hours per week. This duration doesn\u0027t need to be continuous, but must be used in 1-hour increments. If slain in combat, a tin imp is destroyed.\nAdditionally, a creature with the track class feature can command a tin imp he owns to study a set of footprints (a standard action) and designate the creature that made the footprints as its quarry. The tin imp can then attempt to track the creature as if its owner was tracking it, using the owner\u0027s Perception and Survival skill (and any tracking bonuses).; CL 11th; Craft Wondrous Item, animate objects, invisibility, whispering wind.\nGlass Walrus: This figurine of wondrous power is shaped like a walrus and is carved out of a prismatic crystal. It follows all the normal rules for figurines of wondrous power (Pathfinder RPG Core Rulebook 513). When animated, a glass walrus acts in all ways like a normal walrus (see page 29) except it can glide along the surface of water as though under the constant effects of water walk. Up to two Medium creatures or four Small creatures can fit on a glass walrus\u0027s back as the creature glides across water (the walrus moves at half speed while carrying creatures), and the walrus can carry up to 600 pounds in this way before it becomes too encumbered to move. A glass walrus can be used twice per week for up to 6 hours per use. When 6 hours have passed or when the command word is spoken, the glass walrus again becomes a tiny statuette.; CL 11th; Craft Wondrous Item, animate objects, water walk.\nObsidian Raven: This figurine of wondrous power is similar to a silver raven, but it can be used to send messages across the planes. On command, the figurine turns into a raven (retaining its stone-like consistency, which gives it hardness 8). Another command sends it off into the air, bearing a message as the sending spell (with no chance of the message not arriving). The recipient of the message can then use the obsidian raven to plane shift (self only) to the plane from which the message was sent. The figurine can be used in this way once per day. If not commanded to carry a message, the raven obeys the commands of its owner, although it has no special abilities, and it can maintain its non-figurine status for 24 hours per week (the duration need not be continuous).; CL 11th; Craft Wondrous Item, animate objects, plane shift, sending.\nOnyx Dog: When commanded, this statuette changes into a creature with the same properties as a riding dog except that it is endowed with an Intelligence of 8, can communicate in Common, and has exceptional olfactory and visual abilities. It has the scent ability and adds +4 on its Perception checks. It has 60-foot darkvision, and it can see invisibility. An onyx dog can be used once per week for up to 6 hours. It obeys only its owner.; CL 11th; Craft Wondrous Item, animate objects.\nGolden Lions: These figurines come in pairs. They become normal adult male lions. If slain in combat, the lions cannot be brought back from statuette form for 1 full week. Otherwise, they can be used once per day for up to 1 hour. They enlarge and shrink upon speaking the command word.; CL 11th; Craft Wondrous Item, animate objects.\nMarble Elephant: This is the largest of the figurines, the statuette being about the size of a human hand. Upon utterance of the command word, a marble elephant grows to the size and specifications of a true elephant. The animal created from the statuette is fully obedient to the figurine\u0027s owner, serving as a beast of burden, a mount, or a combatant. The statuette can be used four times per month for up to 24 hours at a time.; CL 11th; Craft Wondrous Item, animate objects.\nIvory Goats: These figurines come in threes. Each goat of this trio looks slightly different from the others, and each has a different function:"
  }
}