{
  "id": "ability:shared_strength#hunter_totem_bonded",
  "name": "Shared Strength",
  "tags": ["ability", "class_feature", "hunter"],
  "description": {
    "text": "At 1st level, the connection the totem-bonded has with her animal companion allows them to draw upon one another\u0027s strength. The totem-bonded can activate this ability as a swift action, and she can use it for a number of minutes per day equal to her level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. The effect ends immediately if the animal companion is ever more than 100 feet away from the totem-bonded.\nWhile the shared strength ability is active, the totem-bonded manifests one aspect of her animal companion drawn from the following list: low-light vision, scent, +1 bonus to natural armor, +10-foot bonus to speed, climb speed 30 feet, swim speed 40 feet, 2 claws (1d4), bite (1d6), gore (1d6), or slam (1d6); the natural attacks are all primary attacks, and the listed damage is for a Medium creature. The totem-bonded can select only a movement speed or natural attack that her animal companion also has, and an aspect cannot cause her speed or size to exceed that of her animal companion with this ability. At 8th level, the totem-bonded manifests two aspects of her animal companion, and she adds the following to her list of available aspects: +20-foot bonus to speed, fly speed 50 feet (average), increased size (as enlarge person), and powerful charge (doubles the damage dice dealt by the granted gore or slam attack). At 15th level, the damage dealt by any natural attacks granted by this ability increases by two die steps.\nA totem-bonded\u0027s animal companion also benefits from the shared strength ability, and while it is active, the animal understands the totem-bonded\u0027s known languages and can be pushed to perform an unfamiliar trick as a free action. At 8th level, the animal companion gains a +1 bonus on saving throws and a +2 bonus on checks with each skill in which it has at least 1 rank. At 15th level, the animal companion\u0027s bonuses on saving throws and skill checks increase to +2 and +4 respectively."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}