{
  "id": "ability:runic_focus#wizard_runesage",
  "name": "Runic Focus",
  "tags": ["ability", "class_feature", "wizard"],
  "maxStacks": 1,
  "description": {
    "text": "A runesage can use her knowledge of runes to create a runic focus, a small, semiprecious stone engraved with runes that she manipulates to alter her spellcasting abilities. In function, a runic focus behaves like an ioun stone. To activate a runic focus, the runesage must meditate on it as she prepares her spells. Following spell preparation, she tosses the gemstone into the air, after which it orbits around her head. A runic focus remains in orbit until the next time the runesage prepares her spells. A runic focus automatically functions as a runesage\u0027s bonded object.\nA runesage does not have the option to specialize in an arcane school-all runesages must be universalists. However, when a runesage creates a runic focus, she must choose one Sin school of magic. When she prepares her spells, she is treated as a Sin Magic Specialist of her runic focus\u0027s school for the purposes of determining what spells she can prepare (including gaining two additional spell slots per spell level of her school, and being unable to prepare spells from her runic focus\u0027s two opposition schools). She does not gain the corresponding powers of that school, however, and always functions as a universalist wizard in this regard.\nA runic focus allows the runesage to augment spells of a single arcane school to which the runic focus is aligned. As long as a runic focus remains activated, the runesage doesn\u0027t require material components for any spell she casts from the runic focus\u0027s aligned arcane school, provided the component\u0027s cost never exceeds 10 gp x the runesage\u0027s caster level. If the spell requires a material component that surpasses the cost limit, the runesage must have the material component on hand to cast the spell, as normal.\nA runic focus has an AC of 24, 10 hit points, and hardness 5, as per an ioun stone. While the first runic focus a runesage creates is free, replacement runic foci can be created using the standard rules for replacing a bonded object for a wizard\u0027s arcane bond. When a runesage creates a new runic focus, she can focus it on a different school of Sin magic than her previous focus as long as the new school is not one that was an oppositional school from her previous focus. For example, a runesage with a runic focus on necromancy could abandon that focus and replace it with a new focus on any school other than abjuration and enchantment (as these two schools are opposition schools to Sin necromancy)."
  },
  "stacks": {
    "fixedStack": {
    }
  }
}