{
  "id": "ability:bardic_performance#bard_court_bard",
  "name": "Bardic Performance",
  "tags": ["class_feature", "bard", "ability"],
  "description": {
    "text": "A court bard gains the following types of bardic performance:\nSatire (Su): A court bard can use performance to undermine the confidence of enemies who hear it, causing them to take a –1 penalty on attack and damage rolls (minimum 1) and a –1 penalty on saves against fear and charm effects as long as the bard continues performing. This penalty increases by –1 at 5th level and every six levels thereafter. Satire is a language-dependent, mind-affecting ability that uses audible components.\nThis performance replaces inspire courage.\nMockery (Su): A court bard of 3rd level or higher can subtly ridicule and defame a specific individual. The bard selects one target who can hear his performance. That individual takes a –2 penalty on Charisma checks and Charisma-related skill checks as long as the bard continues performing. This penalty increases by –1 every four levels after 3rd. Mockery is a language-dependent, mind-affecting ability that relies on audible components.\nThis performance replaces inspire competence.\nGlorious Epic (Su): A court bard of 8th level or higher can weave captivating tales that engross those who hear them. Enemies within 30 feet become flat-footed unless they succeed at a Will save (DC 10 + 1/2 the bard\u0027s level + the bard\u0027s Cha modifier). A save renders them immune to this ability for 24 hours. Glorious epic is a language-dependent, mind-affecting ability that uses audible components.\nThis performance replaces dirge of doom.\nScandal (Su): A court bard of 14th level or higher can combine salacious gossip and biting calumny to incite a riot. Each enemy within 30 feet is affected as if by a song of discord for as long as it can hear the performance. A successful Will save (DC 10 + 1/2 the bard\u0027s level + the bard\u0027s Cha modifier) negates the effect, and that creature is immune to this ability for 24 hours. Scandal is a language-dependent, mind-affecting ability that uses audible components."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}