{
  "id": "ability:ghost_mount#cavalier_ghost_rider",
  "name": "Ghost Mount",
  "tags": ["ability", "cavalier", "class_feature"],
  "description": {
    "text": "At 1st level, a ghost rider gains the ability to manifest a special mount of conjured ectoplasm rather than one of flesh and bone. This spectral companion functions like a spiritualist\u0027s phantom companion, using the ghost rider\u0027s cavalier level as her effective spiritualist level. The phantom takes the form of a ghostly creature analogous to one of a cavalier\u0027s normal mount options for her size and class level, such as a Large horse for a Medium ghost rider or a wolf for a Small ghost rider. A ghost rider must choose a mount that is capable of bearing her weight, that has four or more legs, and that lacks a fly speed (although the GM may allow mounts with a swim speed in certain environments). The GM might approve other animals as suitable mounts.\nThe ghost rider can manifest her ghost mount only in ectoplasmic form, and she gains the spiritualist\u0027s etheric tether class feature, applied to her ghost mount.\nThe mount shares the cavalier\u0027s alignment. Though the mount cannot speak, it understands its master\u0027s verbal commands and gains the phantom\u0027s link ability. The ghost mount has good Fortitude and Reflex saves, and can have ranks in any of the following skills: Acrobatics (Dex), Climb (Str), Escape Artist (Dex), Fly (Dex), Intimidate (Cha), Perception (Wis), Stealth (Dex), Survival (Wis), and Swim (Str). The ghost rider\u0027s ghost mount does not gain the share spells, deliver touch spells, or incorporeal flight abilities. Ghost mounts do not gain emotional focus abilities.\nThe ghost rider does not take an armor check penalty on Ride checks while riding her mount. The mount is always considered combat trained, and begins play with Endurance as a bonus feat.\nGhost Mount Starting Statistics: Type animal (phantom); Size one size category larger than the ghost rider; Speed 50 ft.; AC +4 natural armor; Attack bite (1d4), 2 hooves (1d6; this is a secondary natural attack); Ability Scores Str 16, Dex 13, Con 15, Int 2, Wis 12, Cha 6."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}