{
  "id": "ability:6th_level_occultist_spells",
  "name": "6th-Level Occultist Spells",
  "tags": ["class_feature", "occultist", "ability"],
  "description": {
    "text": "Abjuration: antimagic field, forbiddance, globe of invulnerability, repulsion, symbol of vulnerability. Conjuration: call construct, create demiplane, cure moderate wounds (mass), getaway, heal, planar binding, wall of iron. Divination: analyze dweomer, find the path, legend lore, prediction of failure, scrying (greater). Enchantment: antipathy, charm monster (mass), cloak of dreams, symbol of insanity, symbol of strife, sympathy. Evocation: blade barrier, chain lightning, cold ice strike, contagious flame, contingency, forceful hand, freezing sphere, sirocco. Illusion: permanent image, project image. Necromancy: harm, inflict moderate wounds (mass), possession (greater)*, symbol of death, temporary resurrection. Transmutation: animate objects, control construct, disintegrate, enemy hammer, energy siege shot (greater), ironwood, planar adaptation (mass) , statue, transformation.\nSubpages Archetypes Occultist Archetypes - Michael Mars Prehistoric Occultist (Occultist Archetype) Paizo, Inc. - Occultist Archetypes Construct Collector (Occultist Archetype) Extemporaneous Channeler (Occultist Archetype) Planar Harmonizer Esoteric Initiate Geomancer Naturalist Occult Historian Psychodermist Curator Silksworn Secret Broker Sha\u0027ir Ancestral Aspirant Battle Host Haunt Collector Necroccultist Panoply Savant Reliquarian Talisman Crafter Tome Eater Occultist Implements\nSection 15: Copyright Notice Pathfinder Roleplaying Game Occult Adventures © 2015, Paizo Inc.; Authors: John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, John Compton, Adam Daigle, Jim Groves, Thurston Hillman, Eric Hindley, Brandon Hodge, Ben McFarland, Erik Mona, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alex Riggs, Robert Schwalb, Mark Seifter, Russ Taylor, and Steve Townshend."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}