{
  "id": "ability:spirit_power_greater",
  "name": "Spirit Power (Greater)",
  "tags": ["ability", "class_feature", "medium"],
  "description": {
    "text": "A medium serves as a vessel to channel spirits—astral echoes of powerful souls from ages past that live on in myth and legend. Each day, a medium can channel a spirit through a ritual known as a seance. Seances take 1 hour to perform and require the medium’s concentration. A full list of spirits can be found here.\nFAQ The medium class says that spirits can be channeled from any appropriate location, not just from the list of favored locations, but is that true, or can I only channel from one of the favored locations? As the class says, you can channel from any appropriate location, and the favored locations are just a place to start. There might be times where you don’t have access to all six legends, but a medium, either PC or NPC, should generally be able to access a legend if they can come up with a good conceptual tie between the legend and a location he can find or even set up himself. For instance, a medium could go hunt a deer and then use that location to channel a champion spirit of a legendary hunter. [Source]\nAt the end of a seance, the medium invites a local spirit to inhabit him and serve as his spirit for that day. Each spirit arises from one a legend. Though the medium can choose the legend to which the spirit he channels belongs, he must channel that spirit from an appropriate location. Each spirit has a favored location it usually inhabits, though spirits may also be present at other locations appropriate to their legends; such locations are listed in each legend’s Favored Locations entry [also, see FAQ at right]. The medium gains the spirit’s listed seance boon and lesser spirit power for 24 hours. The medium also gains the spirit’s intermediate spirit power at 6th level, its greater spirit power at 11th level, and its supreme spirit power at 17th level. After 24 hours, the medium loses contact with the channeled spirit and can perform another seance.\nA medium can invite his allies to participate in his seance—shared seance and certain spirit powers affect other participants. A character counts as participating so long as she maintains physical contact with another participating character and willfully opens herself to the spirit; unlike the medium, other participating characters can take other actions during this time. Only creatures with an Intelligence score of at least 3 can participate in a seance.\nIn addition to granting power to the medium, a channeled spirit can influence the medium. By channeling a spirit, the medium allows the spirit to gain 1 point of influence over him. If the medium loses that 1 point of influence, he loses contact with the spirit, though he is still unable to perform a new seance until the normal 24 hour period has elapsed since his last seance. When the spirit leaves after the 24-hour duration and before the next seance, the spirit’s influence over the medium resets to 0. Certain abilities allow the medium to gain additional power in exchange for allowing the spirit more influence over him.\nWhen a spirit gains at least 3 points of influence over the medium, the dual impulses housed within the same body cause the medium to meld with his spirit’s consciousness.\nThe resulting muddled sense of self and struggle for control causes the medium to take a –2 penalty on initiative checks as well as a specific additional penalty listed in each spirit’s entry. However, the spirit’s mental presence grants the medium a +4 bonus against possession effects and a +2 bonus on saving throws against mind-affecting effects that are not related to possession.\nIf a spirit ever attains 5 or more points of influence over the medium, the medium completely loses control to the spirit. He effectively becomes an NPC under the GM’s control until after he awakens the next day with the spirit gone.\nDuring his seance, the medium can choose to channel a weaker spirit to gain its help without incurring as much of its influence. If he does so, he can forgo any number of spirit powers, starting with his most powerful spirit power. For each spirit power he forgoes, the medium can use his spirit surge ability twice without incurring influence."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}