{
  "id": "ability:spell_casting",
  "name": "Spell Casting",
  "tags": ["class_feature", "mesmerist", "ability"],
  "description": {
    "text": "Table: Mesmerist Spells Known Level Spells Known 0th 1st 2nd 3rd 4th 5th 6th 1st 4 2 — — — — — 2nd 5 3 — — — — — 3rd 6 4 — — — — — 4th 6 4 2 — — — — 5th 6 4 3 — — — — 6th 6 4 4 — — — — 7th 6 5 4 2 — — — 8th 6 5 4 3 — — — 9th 6 5 4 4 — — — 10th 6 5 5 4 2 — — 11th 6 6 5 4 3 — — 12th 6 6 5 4 4 — — 13th 6 6 5 5 4 2 — 14th 6 6 6 5 4 3 — 15th 6 6 6 5 4 4 — 16th 6 6 6 5 5 4 2 17th 6 6 6 6 5 4 3 18th 6 6 6 6 5 4 4 19th 6 6 6 6 5 5 4 20th 6 6 6 6 6 5 5\nA mesmerist casts psychic spells drawn from the mesmerist spell list. He can cast any spell he knows without preparing it ahead of time. To learn or cast a spell, a mesmerist must have a Charisma score equal to at least 10 + the spell’s level. The saving throw DC against a mesmerist’s spell is 10 + the spell’s level + the mesmerist’s Charisma modifier.\nLike other spellcasters, a mesmerist can cast only a certain number of spells of each spell level per day. His base daily spell allotment is given on Table: Mesmerist. In addition, he receives bonus spells per day if he has a high Charisma score.\nThe mesmerist’s selection of spells is limited. A mesmerist begins play knowing four 0-level spells and two 1st-level spells of the mesmerist’s choice. At each new mesmerist level, he learns one or more new spells, as indicated on Table: Mesmerist Spells Known.\nUnlike a mesmerist’s spells per day, the number of spells a mesmerist knows isn’t affected by his Charisma score; The numbers on the table are fixed.\nAt 5th level and every 3 levels thereafter, a mesmerist can choose to learn a new spell in place of one he already knows.\nIn effect, the mesmerist loses the old spell in exchange for the new one. The new spell’s level must be the same as that of the spell being exchanged, and it must be at least 1 level lower than the highest-level mesmerist spell the mesmerist can cast. A mesmerist can swap only a single spell at any given level, and must choose whether or not to swap the spell at the same time that he gains new spells known for the level.\nA mesmerist need not prepare his spells in advance. He can cast any mesmerist spell he knows at any time, assuming he has not yet used up his allotment of spells per day for the spell’s level.\nKnacks: Mesmerists learn a number of knacks, or 0-level spells. These spells are cast like any other spells, but they do not consume any slots and can be used again. Knacks cast using other spell slots, due to metamagic feats, for example, consume spell slots as normal."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}