{
  "id": "ability:spell_casting#occultist",
  "name": "Spell Casting",
  "tags": ["class_feature", "occultist", "ability"],
  "description": {
    "text": "An occultist casts psychic spells drawn from the occultist spell list, limited by the implement groups he knows.\nHe can cast any spell he knows without preparing it ahead of time. Every occultist spell has an implement component (see Implements). To learn or cast a spell, an occultist must have an Intelligence score equal to at least 10 + the spell level. The Difficulty Class for a saving throw against an occultist’s spell equals 10 + the spell level + the occultist’s Intelligence modifier.\nAn occultist can cast only a certain number of spells of each spell level per day. His base daily spell allotment is given on Table: Occultist. In addition, he gains bonus spells per day if he has a high Intelligence score.\nThe occultist’s selection of spells is limited. For each implement school he learns to use, he can add one spell of each level he can cast to his list of spells known, chosen from that school’s spell list. If he selects the same implement school multiple times, he adds one spell of each level from that school’s list for each time he has selected that school.\nWhen the occultist learns to cast a new level of spells, he immediately adds one spell of that level to his list of spells known from each implement school he knows (plus any extra spells from schools he has selected multiple times).\nAt 5th level and every 3 occultist levels thereafter (8th, 11th, and so on), an occultist can choose to learn a new spell in place of one he already knows. In effect, the occultist loses the old spell in exchange for the new one. The new spell’s level must be the same as that of the spell being exchanged, and it must be at least one level lower than the highest-level occultist spell the occultist can cast. The spell learned must come from the same list of spells provided by the implement school of the spell lost. An occultist can swap only a single spell at any given level, and must choose whether or not to swap the spell at the same time that he gains new spells known for that level.\nAn occultist need not prepare his spells in advance. He can cast any spell he knows at any time, assuming he has not yet used up his allotment of spells per day for the spell’s level."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}