{
  "id": "ability:bold_stare",
  "name": "Bold Stare",
  "tags": ["ability", "class_feature", "mesmerist"],
  "description": {
    "text": "At 3rd level and every 4 levels thereafter, a mesmerist’s hypnotic stare imposes a further effect upon its target. The mesmerist chooses one option each time he gains a new bold stare improvement, and the choice can’t be changed later. The mesmerist can’t choose the same bold stare improvement more than once unless otherwise noted. All of the mesmerist’s bold stare improvements affect the target as long as it is affected by the mesmerist’s hypnotic stare.\nAllure: The hypnotic stare penalty also applies on initiative checks and Perception checks. Disorientation: The hypnotic stare penalty also applies on attack rolls. Disquiet: The target of the hypnotic stare is shaken while in areas of total darkness. Source PCS:OR Distracted: The hypnotic stare penalty also applies to concentration checks. Source PPC:HoG Infiltration: The hypnotic stare penalty also applies to the target’s Perception checks and CMD. Source PCS:OR Lethality: The hypnotic stare penalty also applies to the target’s Fortitude saves versus poison and diseases. Source PCS:OR Nightblindness: The darkvision range of the hypnotic stare’s target decreases by 10 feet. Source PCS:OR Nightmare: The target of the hypnotic stare rolls twice on all Will saves versus fear, taking the lower result. Source PCS:OR Oscillation: The target of the hypnotic stare treats all enemies beyond 30 feet (except the mesmerist) as having concealment (20% miss chance). Source PCS:OR Psychic Inception: The hypnotic stare and its penalty can affect creatures that are mindless or immune to mind-affecting effects (such as an undead or vermin). The mesmerist can also partially affect such a creature with his mind-affecting spells and abilities if it’s under the effect of his hypnotic stare; it gains a +2 bonus on its saving throw (if any), and if affected, it still has a 50% chance each round of ignoring the effect. Ignoring the effect doesn’t end the effect, but does allow the creature to act normally for that round. Restriction: The target of the hypnotic stare treats all areas of dim light or darker as difficult terrain. Source PCS:OR Sabotage: The hypnotic stare penalty also applies to Diplomacy and Intimidate checks. Source PCS:OR Sapped Magic: The hypnotic stare penalty also applies to the DCs of spells and spell-like abilities used by the target, and to the target’s spell resistance (if any). Sensed: The hypnotic stare penalty also applies to Stealth checks. Source PPC:HoG Sluggishness: The target of the hypnotic stare has all of its speeds reduced by 5 feet (to a minimum of 5 feet), and the hypnotic stare penalty also applies to the target’s Reflex saving throws. Susceptibility: The hypnotic stare penalty also applies to the target’s Sense Motive checks to oppose Bluff checks, and to the DCs of Diplomacy and Intimidate checks made against the target. Timidity: The hypnotic stare penalty also applies to damage rolls. Unaided: The target of the hypnotic stare is not able to grant or receive flanking bonuses. Source PPC:HoG"
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}