{
  "id": "ability:shifters_blessing#ranger_shapeshifter",
  "name": "Shifter\u0027s Blessing",
  "tags": ["archetype_feature", "class_feature", "class:ranger#shapeshifter"],
  "description": {
    "text": "At 3rd level, the shapeshifter can take on the aspects of a wild creature once per day as a swift action. He can remain in this form for a number of rounds equal to his Ranger level + his Wisdom modifier. While in one of his shifter\u0027s blessing forms, the Ranger gains the shapeshifter subtype. The shapeshifter must choose one of the following forms. Once this choice is made, it cannot be changed.\nForm of the Bear: The Ranger\u0027s muscles enlarge and tighten, and his facial features become more ursine. While in this form, the Ranger gains a +4 enhancement bonus to Strength, but his base speed becomes 20 feet.\nForm of the Cat: The Ranger\u0027s muscles become lean and defined, and his gait more deliberate and graceful. While in this form, the Ranger increases his base speed by 10 feet, and he gains a +4 bonus on Acrobatics and Climb checks.\nForm of the Dragon: The Ranger\u0027s skin becomes rough and scaly. While in this form, the Ranger gains a +2 natural armor bonus to AC.\nForm of the Eagle: The Ranger\u0027s skin stretches, his nose becomes hooked, and his eyes enlarge. While in this form, the Ranger gains a +10 bonus on Perception checks.\nForm of the Jackal: The Ranger becomes thin and hyperactive, his movements taking on a nervous spryness. While in this form, the Ranger can spend a move action to move up to 1/2 his speed without provoking attacks of opportunity.\nForm of the Otter: The Ranger\u0027s hands and feet grow webs, and his body grows an oily fur that is water resistant. While in this form, the Ranger gains a swim speed of 30 feet and a +8 bonus on Swim checks.\nAt 8th level and again every five levels thereafter, the Ranger may select an additional form for his shifter\u0027s blessing and may use this ability one additional time per day. This is not a polymorph ability; a Ranger with shifter\u0027s blessing in one of his shifted forms can be affected by a polymorph ability and retain his bonus and Traits gained by the class feature.\nThis ability replaces favored terrain."
  },
  "effects": [{
    "addAction": {
      "targetKey": "ability:shifters_blessing#ranger_shapeshifter",
      "numberDelta": 1
    }
  }]
}