{
  "id": "ability:hunters_bond#ranger",
  "name": "Hunter\u0027s Bond",
  "tags": ["class_feature", "ranger", "ability"],
  "maxStacks": 1,
  "description": {
    "text": "At 4th level, a ranger forms a bond with his hunting companions. This bond can take one of two forms. Once the form is chosen, it cannot be changed. The first is a bond to his companions. This bond allows him to spend a move action to grant half his favored enemy bonus against a single target of the appropriate type to all allies within 30 feet who can see or hear him. This bonus lasts for a number of rounds equal to the ranger\u0027s Wisdom modifier (minimum 1). This bonus does not stack with any favored enemy bonuses possessed by his allies; they use whichever bonus is higher.The second option is to form a close bond with an animal companion. A ranger who selects an animal companion can choose from the following list: badger, bird, camel, cat (small), dire rat, dog, horse, pony, snake (viper or constrictor), or wolf. If the campaign takes place wholly or partly in an aquatic environment, the ranger may choose a shark instead. This animal is a loyal companion that accompanies the ranger on his adventures as appropriate for its kind. A ranger\u0027s animal companion shares his favored enemy and favored terrain bonuses.This ability functions like the druid animal companion ability (which is part of the Nature Bond class feature), except that the ranger\u0027s effective druid level is equal to his ranger level –3.A ranger can select a antelopePPC:WO, baboonPPC:WO, bustard, capybara, elkPPC:WO, falcon, kangarooPPC:WO, lizard (giant gecko)PPC:WO, marsupial devil, ramPPC:WO, reindeer, snake (reef snake or spitting cobra), stagPPC:WO, trumpeter swanPPC:WO, thylacinePPC:WO, wolfdog, yak, or zebra as an animal companion. If the campaign takes place in an aquatic environment, the ranger can choose an armorfish or reef snake. A falconer ranger can select a falcon companion instead of a bird companion. PZO1140If the campaign takes place in an aquatic environment, the ranger can choose a stingrayPPC:WO.The ambusher, bully, daredevil, feytouched companion, precocious companion, totem guide, tracker, verdant companion, and wrecker archetypes are all particularly appropriate for a ranger\u0027s animal companion."
  },
  "stacks": {
    "fixedStack": {
      "stacks": [{
      }]
    }
  }
}