{
  "id": "paladin:mercy",
  "name": "Mercy",
  "type": "ABILITY_TYPE_SU",
  "description": "At 3rd level, and every three levels thereafter, a {@class_1} can select one mercy. Each mercy adds an effect to the {@class_1}’s lay on hands ability. Whenever the {@class_1} uses lay on hands to heal damage to one target, the target also receives the additional effects from all of the mercies possessed by the {@class_1}. A mercy can remove a condition caused by a curse, disease, or poison without curing the affliction. Such conditions return after 1 hour unless the mercy actually removes the affliction that causes the condition.\n\nAt 3rd level, the {@class_1} can select from the following initial mercies.\n- _Deceived_: The target can immediately attempt a new saving throw to disbelieve any ongoing illusions that it failed to disbelieve within the last minute. Source PPC:HH\n- _Fatigued_: The target is no longer fatigued.\n- _Riled_: The {@class_1}’s lay on hands also acts as calm emotions, but only for the purpose of suppressing morale bonuses (such as from the rage spell) and emotion effects that aren’t fear effects. Use the {@class_1}’s level as the caster level. Source PPC:HH\n- _Shaken_: The target is no longer shaken.\n- _Sickened_: The target is no longer sickened.\n\nAt 6th level, a {@class_1} adds the following mercies to the list of those that can be selected.\n- _Dazed_: The target is no longer dazed.\n- _Diseased_: The {@class_1}’s lay on hands ability also acts as remove disease, using the {@class_1}’s level as the caster level.\n- _Enfeebled_: The {@class_1} dispels any magical effects that are reducing one of the target’s ability scores ({@class_1}’s choice). Source PPC:HH\n- _Haunted_: The {@class_1}’s lay on hands also acts as protection from evil, but only for the purpose of allowing a new saving throw against enchantment (charm) and enchantment (compulsion) effects, making the target immune to any attempts to possess or exercise mental control over the target, or preventing a life force from controlling the target (all as described in the second effect of protection from evil). Use the {@class_1}’s level as the caster level. Source PPC:HH\n- _Staggered_: The target is no longer staggered, unless the target is at exactly 0 hit points.\n- _Targeted_: The {@class_1}’s lay on hands also acts as sanctuary, using the {@class_1}’s level as the caster level. The saving throw DC to negate this effect is equal to 10 + 1/2 the {@class_1}’s level + the {@class_1}’s Charisma modifier. Source PPC:HH\n\nAt 9th level, a {@class_1} adds the following mercies to the list of those that can be selected.\n- _Confused_: The target is no longer confused. Source PPC:HH\n- _Cursed_: The {@class_1}’s lay on hands ability also acts as remove curse, using the {@class_1}’s level as the caster level.\n- _Exhausted_: The target is no longer exhausted. The {@class_1} must have the fatigue mercy before selecting this mercy.\n- _Frightened_: The target is no longer frightened. The {@class_1} must have the shaken mercy before selecting this mercy.\n- _Injured_: The target gains fast healing 3 for a number of rounds equal to 1/2 the {@class_1}’s level. Source PPC:HH\n- _Nauseated_: The target is no longer nauseated. The {@class_1} must have the sickened mercy before selecting this mercy.\n- _Poisoned_: The {@class_1}’s lay on hands ability also acts as neutralize poison, using the {@class_1}’s level as the caster level.\n- _Restorative_: The target heals 1d4 points of ability damage from a single ability score of the {@class_1}’s choosing. The {@class_1} must have the enfeebled mercy before selecting this mercy. Source PPC:HH\n\nAt 12th level, a {@class_1} adds the following mercies to the list of those that can be selected.\n- _Amputated_: The {@class_1}’s lay on hands also acts as regenerate, but only for the purposes of regrowing severed body members, broken bones, and ruined organs. The {@class_1} must have the injured mercy before she can select this mercy. Source PPC:HH\n- _Blinded_: The target is no longer blinded.\n- _Deafened_: The target is no longer deafened.\n- _Ensorcelled_: The {@class_1}’s lay on hands also acts as dispel magic, using the {@class_1}’s level as her caster level (maximum 20). Source PPC:HH\n- _Paralyzed_: The target is no longer paralyzed.\n- _Petrified_: The {@class_1}’s lay on hands ability also acts as stone to flesh, but only for the purpose of removing the petrified condition from a creature. Source PPC:HH\n- _Stunned_: The target is no longer stunned.\n\nThese abilities are cumulative. For example, a 12th-level {@class_1}’s lay on hands ability heals 6d6 points of damage and might also cure Fatigued and Exhausted conditions as well as removing diseases and neutralizing poisons. Once a condition or spell effect is chosen, it can’t be changed."
}