{
  "id": "spell:revenant_armor",
  "name": "Revenant Armor",
  "tags": ["spell", "transmutation", "arcanist", "arcanist4", "cleric", "cleric4", "magus", "magus4", "oracle", "oracle4", "paladin", "paladin3", "shaman", "shaman3", "sorcerer", "sorcerer4", "warpriest", "warpriest4", "witch", "witch3", "wizard", "wizard4"],
  "prerequisiteFormula": "any(@class:arcanist\u003e\u003d8,@class:cleric\u003e\u003d5,@class:magus\u003e\u003d7,@class:oracle\u003e\u003d8,@class:paladin\u003e\u003d10,@class:shaman\u003e\u003d3,@class:sorcerer\u003e\u003d8,@class:warpriest\u003e\u003d4,@class:witch\u003e\u003d3,@class:wizard\u003e\u003d5)",
  "description": {
    "text": "This spell endows a suit of armor with a singular purpose realized only after its wearer goes unconscious or is killed; whenever the wearer of a suit of armor warded by revenant armor is brought below 0 hit points or otherwise rendered unconscious (but not paralyzed or held) in combat, the armor is immediately brought to life as a Medium animated object. This animated suit of armor still contains the unconscious (or dead) body of its former wearer and moves with a shambling gait at a speed of 20 feet. This animated object has average hit points and, if the armor is made from metal, it has the metal animated object extraordinary ability (plus additional abilities based on the type of metal, as indicated on page 14 of the Pathfinder RPG Bestiary). Once animated, the revenant armor remains standing (and stands if knocked prone, doing so without provoking attacks of opportunity), and prevents the wearer of the armor from being considered helpless. If an ally of the wearer is within range of the armor, she can direct it to move, though it refuses to go anywhere that requires a skill check. If grappled or otherwise restrained, it can attempt to break free with a Strength score equal to your caster level and a CMB equal to 1 + your caster level + the armor\u0027s Strength modifier. If the armor\u0027s wearer is reduced to dust, made conscious, or removed from the armor, the spell ends."
  }
}