{
  "id": "spell:plundered_power",
  "name": "Plundered Power",
  "tags": ["sorcerer", "spell", "cleric", "oracle", "shaman7", "shaman", "sorcerer7", "arcanist7", "druid7", "druid", "summoner6", "necromancy_evil", "oracle7", "arcanist", "witch", "summoner", "wizard", "wizard7", "witch7", "cleric7"],
  "prerequisiteFormula": "any(@class:arcanist\u003e\u003d14,@class:cleric\u003e\u003d11,@class:druid\u003e\u003d11,@class:oracle\u003e\u003d14,@class:shaman\u003e\u003d11,@class:sorcerer\u003e\u003d14,@class:summoner\u003e\u003d16,@class:witch\u003e\u003d11,@class:wizard\u003e\u003d11)",
  "description": {
    "text": "You must sacrifice a creature just as you finish casting this spell. When the sacrifice dies, its blood or ichor pools and hardens into a single red bloodstone. This bloodstone contains the essence and spirit of the sacrificed creature, allowing anyone holding the stone to activate the creature\u0027s highest-level activated racial spell-like ability, taking the actions necessary to activate the stored spell-like ability. Any creature who holds the stone can activate it, but the stone can be used only once per day (or the frequency of the creature\u0027s spell-like ability, whichever is less). If a creature has several racial spell-like abilities of the same spell level, choose randomly from among them to determine which one is stored in the bloodstone. The bloodstone can only store racial spell-like abilities that emulate a spell, including altered spells, like invisibility (self only), but not unique spell-like abilities possessed by the creature. Abilities with altered effects are still altered, so a creature activating the bloodstone for greater teleport (self only) would affect only itself and a bloodstone storing summon monster II (Small fire elemental only) would still only be able to summon a Small fire elemental. Additionally, the bloodstone can\u0027t store spell-like abilities that duplicate spells with expensive components costing more than 250 gp."
  }
}