{
  "id": "ability:infused_grit#gunslinger_planar_rifter",
  "name": "Infused Grit",
  "tags": ["class:gunslinger#planar_rifter", "archetype_feature", "class_feature"],
  "description": {
    "text": "Each day when a planar rifter recovers grit, he can attune his grit pool to one of the following subtypes: air, chaotic, earth, evil, fire, good, lawful, or water.\nWhenever he is on a plane that has an alignment or elemental trait, he can switch his attunement to match one of that plane\u0027s traits as a standard action. After reducing an outsider to 0 hit points or below, he can switch his attunement to match one of that outsider\u0027s subtypes as a free action. He regains grit as normal from critical hits, but killing blows replenish his grit pool only if the target is an outsider.\nThis alters grit.\nDeeds: A planar rifter gains the following deeds.\nInfused Bullet (Su) At 1st level, a planar rifter\u0027s bullets carry the essence of a plane to which his grit pool is attuned, striking true against creatures that shrink from that plane\u0027s nature. As long as he has at least 1 point in his grit pool, he gains the following benefits: if he infuses his bullets with an alignment, his bullet\u0027s damage counts as that alignment for the purposes of overcoming DR; if he infuses his bullets with an element, half of his bullet\u0027s damage changes to an energy type determined by the element infused: acid (earth), cold (water), electricity (air), or fire (fire).\nThis deed replaces the deadeye deed.\nPlanar Surge (Su) At 7th level, a planar rifter can spend 1 grit point as a swift action to change the attunement of his grit pool to any alignment or element. This new attunement remains for 1 minute, after which time the grit pool becomes unattuned.\nThis deed replaces the dead shot deed.\nBreaching Shot (Su) At 15th level, a planar rifter can fire bullets with such precision that he tears temporary rifts between planes. As a standard action, he can spend 3 grit points to shoot at a location within his firearm\u0027s first range increment and tear a 10-foot-radius portal to a plane of his choice. The rift leads to a random location on the plane that is between 5 and 500 miles from his intended destination, as plane shift. The rift remains open for 1 minute, during which time any number of willing creatures can pass through. It is a one-way rift, and it is insufficiently stable to reveal details about the environment on the other side.\nThis deed replaces the menacing shot deed.\nBanishing Shot (Su) At 19th level, whenever a planar rifter confirms a critical hit against an extraplanar target, he can spend 1 grit to deal normal damage, and the target must succeed at a Will saving throw with a DC equal to 20 + the planar rifter\u0027s Wisdom modifier. On a failed saving throw, the target is returned to its original plane as per the banishment spell."
  },
  "effects": [{
    "targetKey": "ability:infused_grit#gunslinger_planar_rifter",
    "addAction": {
      "numberDelta": 1
    }
  }]
}