{
  "id": "ability:sense_intruder#ranger_sentinel",
  "name": "Sense Intruder",
  "tags": ["class:ranger#sentinel", "archetype_feature", "class_feature"],
  "description": {
    "text": "At 6th level, a sentinel gains the ability to establish an incredibly effective watch by standing still and focusing on all of her senses as once. At any time, she can spend 1 minute setting up this ability. Once she has done so, she must stand still, taking no other actions except to keep track of her surroundings; she can\u0027t even take free actions like talking. Her heightened senses grant her a supernatural awareness of her surroundings within 20 feet. If any Tiny or larger creature enters the area over which her awareness extends, she automatically knows that it did so (this part of the ability is a divination effect and can\u0027t be deceived by spells that block sensory input, only by extreme effects like mind blank). Furthermore, unless that creature is simultaneously negating its visual, auditory, and scent stimuli (such as by being under invisibility, silence, and negate aroma all at once), the sentinel can attempt a Perception check as an immediate action to pinpoint the intruder\u0027s location, ignoring any Stealth bonuses the intruder might gain from effects that obscure only one of those senses, such as invisibility, camouflage, or other spells or abilities.\nThis sort of heightened analysis of sensory stimuli is taxing, as much so as hustling overland for an equivalent period of time, despite not moving from a single spot. The sentinel can use this ability for 1 hour without penalty.\nUsing sense intruder for a second hour in between sleep cycles deals 1 point of nonlethal damage to the sentinel, and each additional hour deals twice the damage taken during the previous hour. A sentinel who takes any nonlethal damage from using this ability becomes fatigued. Each hour the sentinel uses sense intruder also counts as 1 hour of hustling overland for the purpose of determining how much nonlethal damage the sentinel takes in a single day.\nStarting at 10th level, whenever the sentinel gains a combat style feat, she can choose to trade it for a 10-foot increase in the radius of this ability."
  },
  "effects": [{
    "targetKey": "ability:sense_intruder#ranger_sentinel",
    "addAction": {
      "numberDelta": 1
    }
  }]
}