{
  "id": "ability:battle_dance#bard_dervish_of_dawn",
  "name": "Battle Dance",
  "tags": ["class:bard#dervish_of_dawn", "archetype_feature", "class_feature"],
  "description": {
    "text": "Dervishes of dawn are trained in the use of the Perform skill, especially dance, to create magical effects on himself. This works like bardic performance, except that the performances grant double their normal bonuses, but these bonuses only affect him. He does not need to be able to see or hear his own performance. Battle dancing is treated as bardic performance for the purposes of feats, abilities, and effects that affect bardic performance, except that battle dancing does not benefit from the Lingering Performance feat or any other ability that allows a bardic performance to grant bonuses after it has ended. The benefits of battle dancing apply only when the bard is wearing light or no armor. Like bardic performance, battle dancing cannot be maintained at the same time as other performance abilities.\nStarting a battle dance is a move action, but it can be maintained each round as a free action. Changing a battle dance from one effect to another requires the dervish to stop the previous performance and start the new one as a move action. Like a bard, a dervish of dawn\u0027s performance ends immediately if he is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action each round. A dervish of dawn cannot perform more than one battle dance at a time.\nAt 10th level, the dervish can start a battle dance as a swift action instead of a move action.\nWhen a dervish of dawn uses the inspire courage, inspire greatness, or inspire heroics bardic performance types as battle dances, these performance types only provide benefit to the dervish himself. All other types of bardic performance work normally (affecting the bard and his allies, or the bard\u0027s enemies, as appropriate)."
  },
  "effects": [{
    "targetKey": "ability:battle_dance#bard_dervish_of_dawn",
    "addAction": {
      "numberDelta": 1
    }
  }]
}