{
  "id": "ability:plant_focus#hunter_plant_master",
  "name": "Plant Focus",
  "tags": ["class:hunter#plant_master", "archetype_feature", "class_feature"],
  "description": {
    "text": "A plant master can take on the aspect of a plant as a swift action. He must select one type of plant to emulate, gaining a bonus or special ability based on the type of plant emulated and his hunter level. The plant master can use this ability for a number of minutes per day equal to his level. This duration does not need to be consecutive but must be spent in 1-minute increments. He can emulate only one plant at a time.\nThe plant master can also apply one of these aspects to his plant companion. An aspect applied in this way does not count against the hunter\u0027s minutes of duration per day--it remains in effect until he changes it. The companion\u0027s aspect can be the same aspect the hunter has taken on or a different one. A plant master can select or change the plant foci on both himself and his plant companion as part of the same swift action.\nAssassin Vine: The creature gains a +2 bonus on combat maneuver checks to grapple. This bonus increases to +3 at 8th level and +4 at 15th level. Brambles: When the creature is hit by an unarmed strike or natural attack, the attacker takes 1 point of piercing damage. This increases to 2 points at 8th level and 3 points at 15th level. Creeping Vine: The creature gains a +4 competence bonus on Climb checks. This bonus increases to +6 at 8th level and +8 at 15th level. Giant Flytrap: The creature gains a +4 competence bonus on Stealth checks. This bonus increases to +6 at 8th level and +8 at 15th level. Mushroom: The creature gains a +4 enhancement bonus on saves against poison. This bonus increases to +6 at 8th level and +8 at 15th level. Oak: The creature gains a +2 enhancement bonus to CMD. This bonus increases to +4 at 8th level and +6 at 15th level. Shrieker: The creature gains darkvision with a range of 60 feet. At 8th level, the range increases by 30 feet. At 15th level, the creature also gains blindsense with a range of 10 feet. Spore: The creature gains a +4 competence bonus on Fly checks. This bonus increases to +6 at 8th level and +8 at 15th level. Water Lily: The creature gains a +4 competence bonus on Swim checks. This bonus increases to +6 at 8th level and +8 at 15th level."
  },
  "effects": [{
    "targetKey": "ability:plant_focus#hunter_plant_master",
    "addAction": {
      "numberDelta": 1
    }
  }]
}