{
  "id": "ability:sacred_animal_focus#hunter_scarab_stalker",
  "name": "Sacred Animal Focus",
  "tags": ["class:hunter#scarab_stalker", "archetype_feature", "class_feature"],
  "description": {
    "text": "A scarab stalker can select from the bull, falcon, and snake animal foci, as well as the following new animal foci.\nBee: The creature gains a +4 competence bonus on Fly checks. This bonus increases to +6 at 8th level and +8 at 15th level. Cat: The creature gains a +4 competence bonus on Acrobatics checks. This bonus increases to +6 at 8th level and +8 at 15th level. Cow: The creature gains a +1 resistance bonus on Fortitude saving throws. This bonus increases to +2 at 8th level and +3 at 15th level. Crocodile: The creature gains a +4 competence bonus on Swim checks. This bonus increases to +6 at 8th level and +3 at 15th level. Ibis: The creature gains a +2 resistance bonus on saving throws against disease. This bonus increases to +4 at 8th level and +6 at 15th level. Jackal: The creature gains a +4 competence bonus on Survival checks. This bonus increases to +6 at 8th level and +8 at 15th level. Kite: The creature recovers 1 additional hit point whenever it receives magical healing. This increases to 2 additional hit points at 8th level and 3 additional hit points at 15th level. Leopard: The creature gains a +4 competence bonus on Escape Artist checks. This bonus increases to +6 at 8th level and +8 at 15th level. Lion: The creature gains a +4 competence bonus on Intimidate checks. This bonus increases to +6 at 8th level and +8 at 15th level. Ram: The creature gains a +1 bonus on damage rolls when making charge attacks. This bonus increases to +2 at 8th level and +3 at 15th level. Scarab Beetle: The creature gains a +1 enhancement bonus to its natural armor bonus. This bonus increases to +2 at 8th level and +3 at 15th level. Scorpion: The creature gains a +2 resistance bonus on saving throws against poison. This bonus increases to +4 at 8th level and +6 at 15th level. Sha: The creature ignores the Perception penalty from sandstorms and can see twice as far in sandstorms. This increases to three times as far at 8th level and four times as far at 15th level. Uraeus: The creature gains a +2 resistance bonus on saving throws against breath weapons. This bonus increases to +4 at 8th level and +6 at 15th level."
  },
  "effects": [{
    "targetKey": "ability:sacred_animal_focus#hunter_scarab_stalker",
    "addAction": {
      "numberDelta": 1
    }
  }]
}