{
  "id": "ability:hunters_tricks#ranger_skirmisher",
  "name": "Hunter\u0027s Tricks",
  "tags": ["class_feature", "ranger", "ability"],
  "description": {
    "text": "At 5th level, a skirmisher Ranger learns the use of hunter\u0027s tricks, which typically grant a boon or bonus to the Ranger or a nearby ally. At 5th level, the Ranger learns one trick, selected from the list below. At 7th level, and every two levels thereafter, he learns another trick. A Ranger can use these tricks a total number of times per day equal to 1/2 his Ranger level + his Wisdom modifier. Tricks are usually swift actions, but sometimes move or free actions that modify a standard action, usually an attack action. Once a trick is chosen, it can\u0027t be retrained. A Ranger cannot select an individual trick more than once.\nThe following is a list of hunter tricks and their effects.\nAiding Attack (Ex): The Ranger can use this trick as a free action when he hits a creature with an attack. The next ally who makes an attack against the target creature before the start of the Ranger\u0027s next turn gains a +2 circumstance bonus on that attack roll.\nBolster Companion (Ex): The Ranger can use this trick as an immediate action when his animal companion is hit with an attack or a combat maneuver. The companion\u0027s AC and combat maneuver defense increase by +4 for the purposes of that attack. If the attack still hits, the animal companion only takes half damage (if any). The animal companion must be able to see and hear the Ranger to benefit from this trick.\nCatfall (Ex): The Ranger can use this trick as an immediate action when he falls 20 or more feet, ignoring the first 20 feet of the fall when calculating the falling damage. If the Ranger takes no damage from the fall, he does not fall prone.\nChameleon Step (Ex): The Ranger can move up to twice his speed as a move action. The Ranger does not take any penalty on Stealth checks for movement during this move. This move provokes attacks of opportunity as normal.\nCunning Pantomime (Ex): As a standard action, the Ranger can communicate with a single creature as if using the tongues spell for 10 minutes. Because the communication is slow and lacks subtlety, the Ranger suffers a –4 penalty on all Bluff and Diplomacy checks relating to the creature he is communicating with when using this trick.\nDefensive Bow Stance (Ex): The Ranger can use this trick as a swift action. Until the start of his next turn, his ranged attacks do not provoke attacks of opportunity.\nDeft Stand (Ex): The Ranger can spend a move action to stand up without provoking attacks of opportunity.\nDistracting Attack (Ex): The Ranger can use this trick as a free action before he makes an attack. If the attack hits, the target takes a –2 penalty on all attack rolls for 1 round.\nHateful Attack (Ex): The Ranger can use this trick as a free action when he makes an attack against one of his favored enemies. The Ranger doubles the threat range of his weapon for this attack. This does not stack with other abilities that increase a weapon\u0027s threat range.\nHeel (Ex): The Ranger can use this trick as an immediate action when his animal companion moves. When the companion moves, the square it starts out in is not considered threatened by any opponent it can see, and therefore visible enemies do not get attacks of opportunity against it when it moves from that square. The companion must end this movement in a square adjacent to the Ranger. The animal companion must be able to see and hear the Ranger to take this movement.\nHobbling Attack (Ex): The Ranger can use this trick as a free action when he hits with an attack. The target of the attack\u0027s land speed is reduced by 1/2 for 1d4 rounds.\nQuick Climb (Ex): The Ranger can climb at his full speed as a move action without penalty.\nQuick Healing (Ex): As a swift action, the Ranger can make a Heal check to administer first aid on an adjacent dying character. Alternatively, the Ranger can administer a potion to an unconscious character as a move action.\nQuick Swim (Ex): The Ranger can swim at his full speed as a move action without penalty.\nRanger\u0027s Counsel (Ex): As a swift action, the Ranger can grant all allies within 30 feet that are within line of sight and can hear him a +2 bonus on skill checks with a single skill of his choice. The Ranger must have at least one rank in the chosen skill. This bonus lasts for 1 round.\nRattling Strike (Ex): The Ranger can use this trick as a free action before he makes a melee attack. If the attack hits, the target is shaken for 1d4 rounds.\nSecond Chance Strike (Ex): When he misses with a melee attack, the Ranger may reroll his attack at a –5 penalty. Using this ability is an immediate action.\nSic ‘Em (Ex): The Ranger can use this trick as a swift action. His animal companion makes one melee attack against an adjacent creature. The animal companion must be able to see and hear the Ranger to make this attack.\nSkill Sage (Ex): As a free action, the Ranger can roll twice on any one skill check and take the better result. He must have at least 1 rank in that skill to use this ability.\nStag\u0027s Leap (Ex): As a free action, the Ranger can attempt a running jump without moving 10 feet before the jump.\nSurprise Shift (Ex): The Ranger can move 5 feet as a swift action. This movement does not provoke attacks of opportunity and does not count as a 5-foot step.\nTangling Attack (Ex): The Ranger can use this attack as a free action when he makes an attack. If the attack hits, the target is entangled for 1 round.\nTrick Shot (Ex): As a standard action, the Ranger can make a ranged attack that ignores concealment (but not total concealment), soft cover, and partial cover.\nUncanny Senses (Ex): As an immediate action, the Ranger gains a +10 insight bonus on Perception checks for 1 round.\nUpending Strike (Ex): The Ranger can use this trick as a free action just before he makes a melee attack. If the attack hits, he may make a free trip combat maneuver against the target.\nVengeance Strike (Ex): The Ranger can use this trick as an immediate action when an enemy adjacent to him hits an ally with a melee or ranged attack. The Ranger can make a single melee attack at his highest base attack bonus against the creature who attacked his ally."
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}