{
  "id": "ability:masterful_tricks",
  "name": "Masterful Tricks",
  "tags": ["class_feature", "mesmerist", "ability"],
  "description": {
    "text": "At 12th level, a mesmerist can choose one of the following masterful tricks in place of a mesmerist trick. He gains an additional masterful trick every 2 levels thereafter. Using a masterful trick consumes two uses of the mesmerist trick class feature instead of one.\nAllay Pain: The subject of this trick gains DR 15/— against one attack that deals nonlethal damage. The mesmerist can trigger this trick whenever the subject is hit with an attack that deals nonlethal damage. Source PCS:OR Avian Escape: The subject changes shape to elude an attacking enemy. The mesmerist can trigger this trick when the subject takes damage from an enemy’s attack. The subject transforms into a bird (as beast shape III). Though the subject can appear as any Tiny bird, it uses the statistics for a raven. This is a polymorph effect. Concealing Veil: When this trick is triggered, the subject is affected by a nondetection spell for 1 round per mesmerist level. Source PPC:OO Cursed Sanction: A ward curses an enemy who attacks the subject. While this trick is implanted, a visible, circular symbol appears on the subject’s forehead. The mesmerist can trigger this trick when the subject is attacked or becomes the target of a spell that requires an attack roll. The attacker takes a –4 penalty on attack rolls, saves, ability checks, and skill checks for 1 minute per mesmerist level (Will negates). This penalty applies to the triggering attack roll. This is a curse effect. Faked Death: The subject appears to die, but actually can stealthily move about. The mesmerist can trigger this trick when the subject is damaged by an attack. The subject seems to fall down dead (as programmed image), but actually turns invisible (as invisibility) for a number of rounds equal to the mesmerist’s level or until she attacks. Once the subject becomes visible again, the illusory dead body disappears. These are illusion effects, and a creature that interacts with the false body can attempt a saving throw to disbelieve the effect. The false body is a figment; the invisibility is a glamer. Free in Body: When constrained, the subject can easily slip loose. The mesmerist can trigger this trick when the subject begins its turn grappled or under an effect that impedes its movement (including paralysis, solid fog, slow, and web). The subject gains the benefits of freedom of movement for 1 minute. Greater Mask Misery: This trick functions as the mask misery trick, but can be used to ignore greater conditions as well. A mesmerist must have the mask misery mesmerist trick to take greater mask misery. Mental Fallback: Mental commands placed deep in the subject’s mind trigger when she would fall under mind control, allowing the mesmerist to control her instead. The mesmerist can trigger this trick when the subject is affected by a charm or compulsion effect created by an enemy. The subject acts as though the mesmerist had cast the spell instead of the enemy. For instance, if the subject were affected by charm monster cast by an enemy, that enemy can’t try to give her orders, but the mesmerist could. If the charm or compulsion causes penalties or conditions (such as those imposed by confusion, crushing despair, or hold person), the subject can ignore any of those penalties or conditions the mesmerist chooses. This trick overrides the charm or compulsion for a number of rounds equal to the mesmerist’s level or until the duration of the triggering effect elapses, whichever comes first. The mesmerist can’t implant this trick on himself. Shadow Blend: The mesmerist can trigger this trick whenever the subject attempts a Stealth check while in an area of dim or darker light. The subject gains total concealment from all enemies (50% miss chance) as long as it remains within areas of dim or darker light. Against creatures with darkvision, the subject gains concealment (20% miss chance) rather than total concealment. Once triggered, this effect lasts for 1 round per mesmerist level or until the subject enters an area of normal or brighter light. Source PCS:OR Spatial Switch: The mesmerist allows himself and an ally to physically swap places. The mesmerist can trigger this trick when an enemy moves adjacent to or attacks either the subject or the mesmerist, provided the subject and the mesmerist are within 100 feet of one another. The subject and the mesmerist then swap positions. If this trick was triggered by an attack, the swap happens before checking to see whether the attack hits. The mesmerist can’t implant this trick on himself. This is a conjuration (teleportation) effect. Spell Anticipation: The mesmerist can choose a spell to strike back at enemy spellcasters. When the mesmerist implants this trick, he must expend one spell slot to couple a spell he knows of that level with the trick. That spell must have a casting time of 1 standard action or less and be able to target one creature (spells like dominate person that have more restrictive targeting can be used, but have no effect if triggered against creatures that don’t match). He can trigger this trick when the subject is targeted by an enemy’s spell. The mesmerist’s spell then triggers, affecting only the enemy spellcaster. This takes effect only if the enemy spellcaster is within range of the spell (as measured from the subject of the trick), and functions as though the mesmerist were in the subject’s square. The enemy’s spell still has its full effect, even if the mesmerist’s spell would normally protect against it or make the caster unable to cast it. Umbral Transformation: The subject of this trick turns into a living shadow for 1 round, as if affected by shadow body. After this trick ends, the subject is staggered for 1 round. Source PCS:OR Vision of Blood: When an enemy is struck by the subject, it believes its wound is far more severe, and the shock overwhelms it. The mesmerist can trigger this trick when the subject hits with an attack using a weapon, a natural weapon, or an unarmed strike. The attack’s target must succeed at a Will saving throw or be stunned for 1 round. If the triggering attack was a critical hit, the target doesn’t get a saving throw. Willful Ignorance: The subject gains the ability to tell one undetectable lie. When the subject attempts to lie, the mesmerist can trigger this trick. That particular lie resists truth-detecting magic, and creatures attempting to use such magic must succeed at a caster level check against a DC equal to 15 + the mesmerist’s class level to succeed; failure means the magic doesn’t detect the subject’s lie or force her to speak only the truth. Source PPC:OO"
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}