{
  "id": "ability:kinetic_blast#kineticist",
  "name": "Kinetic Blast",
  "tags": ["class_feature", "kineticist", "ability"],
  "description": {
    "text": "At 1st level, a kineticist gains a kinetic blast wild talent of her choice. This kinetic blast must be a simple blast that matches her element. Simple blasts are listed with their corresponding elements.\nAs a standard action, the kineticist can unleash a kinetic blast at a single target up to a range of 30 feet. She must have at least one hand free to aim the blast (or one prehensile appendage, if she doesn’t have hands). All damage from a kinetic blast is treated as magic for the purpose of bypassing damage reduction. Kinetic blasts count as a type of weapon for the purpose of feats such as Weapon Focus. The kineticist is never considered to be wielding or gripping the kinetic blast (regardless of effects from form infusions; see Infusion), and she can’t use Vital Strike feats with kinetic blasts. Even the weakest kinetic blast involves a sizable mass of elemental matter or energy, so kinetic blasts always deal full damage to swarms of any size (though only area blasts deal extra damage to swarms). A readied kinetic blast can be used to counterspell any spell of equal or lower level that shares its descriptor. A kinetic blast that deals energy damage of any type (including force) has the corresponding descriptor.\nEach simple blast is either a physical blast or an energy blast.\nPhysical blasts are ranged attacks that deal an amount of damage equal to 1d6+1 + the kineticist’s Constitution modifier, increasing by 1d6+1 for every 2 kineticist levels beyond 1st. Spell resistance doesn’t apply against physical blasts.\nEnergy blasts are ranged touch attacks that deal an amount of damage equal to 1d6 + 1/2 the kineticist’s Constitution modifier, increasing by 1d6 for every 2 kineticist levels beyond 1st.\nComposite blasts combine elements to form a new blast. When a kineticist gains a new element through expanded element, she gains access to all composite blasts for which she qualifies. All composite blasts are listed after the kineticist elements.\nMost composite blasts are either physical or energy blasts, like simple blasts.\nPhysical composite blasts deal an amount of damage equal to 2d6+2 + the kineticist’s Constitution modifier, increasing by 2d6+2 for every 2 kineticist levels beyond 1st.\nEnergy composite blasts deal an amount of damage equal to 2d6 + 1/2 the kineticist’s Constitution modifier, increasing by 2d6 for every 2 kineticist levels beyond 1st.\nA complete listing of kinetic blasts and composite blasts can be found within the Kineticist Elements page, here: Kineticist Elements"
  },
  "stacks": {
    "repeatingStack": {
    }
  }
}