{
  "id": "ability:primal_bond#druid_progenitor",
  "name": "Primal Bond",
  "tags": ["archetype_feature", "class_feature", "class:druid#progenitor"],
  "description": {
    "text": "A progenitor infuses herself with fey magic so that she is treated as either her original creature type or the fey type for the purposes of spells or effects that target a creature by type, whichever is more beneficial to her. Additionally, the progenitor chooses one of two forms through which this bond expresses itself: magic or nature.\nA progenitor who chooses magic as her primal bond can draw upon wild magic as a swift action to attempt to cast a prepared spell without losing that spell from its spell slot.\nTo use this ability, she casts the spell as she would normally, but as the spell\u0027s effects take place, she must attempt a concentration check (DC \u003d 20 + twice the spell\u0027s level). If she fails, she expends the spell normally as if she had cast it, but its effects are replaced by a wild magic effect with a CR equal to her caster level and she is staggered until the end of her next turn. If she succeeds, she casts the spell normally and it is not expended from her prepared spell slot, allowing her to cast that spell again at a later point. A progenitor can use wild magic in this manner once per day plus one additional time per day at 5th level and every 5 levels thereafter.\nA progenitor who chooses nature as her primal bond can create plants as a full-round action. She can do so once per day plus one additional time per day per 5 levels. At the start of her next turn, so long as she is touching a solid surface underfoot, a 5-foot radius of mobile undergrowth springs to life around the progenitor for a number of rounds equal to 3 plus the progenitor\u0027s Wisdom bonus. Upon activating this ability, the progenitor chooses whether the undergrowth provides cover or difficult terrain. If the progenitor chooses cover, her undergrowth provides a cover bonus to AC to the progenitor and allies within the radius. If she chooses difficult terrain, enemies who enter the radius of undergrowth treat it as difficult terrain. A progenitor\u0027s undergrowth is treated as forest terrain if it provides cover and plains terrain if it provides difficult terrain. This radius increases by 5 feet at 5th level and every 5 levels thereafter."
  },
  "effects": [{
    "targetKey": "ability:primal_bond#druid_progenitor",
    "addAction": {
      "numberDelta": 1
    }
  }]
}