{
  "id": "ability:animal_spirit#druid_supernaturalist",
  "name": "Animal Spirit",
  "tags": ["archetype_feature", "class:druid#supernaturalist", "class_feature"],
  "description": {
    "text": "At 4th level, a supernaturalist can perform a seance to call an animal spirit of any animal with which she is familiar to serve as her companion and guide. The supernaturalist gains spirit, spirit bonus, spirit surge, and taboo abilities as a medium 3 levels lower than her druid level. The supernaturalist\u0027s allies cannot participate in this seance.\nThe spirit abilities of the animal spirit are as follows:\nSpirit Bonus: Your spirit bonus applies on attack and damage rolls with natural weapons and on skill checks relating to animals and plants. Seance Boon: Your natural armor bonus to AC increases by 1. Favored Location: Native terrain of the animal type being invoked. Influence Penalty: You become wild and savage, taking a penalty equal to your spirit bonus on caster level checks, Charisma– and Intelligence-based ability checks, and skill checks. Taboos: Choose one: you must not speak (except with animals and plants); you must not wield manufactured weapons; you must not eat anything you did not kill or harvest yourself. Totem Transformation (Lesser, Su): You gain any of the following abilities possessed by the animal you select as your animal spirit: bite (1d6 for a Medium druid), 2 claws (1d4 for a Medium druid), darkvision, improved land movement speed (up to a +20-foot enhancement bonus to the druid\u0027s base land movement speed), low-light vision, scent, and swim (up to 30 feet). Pack Leader (Intermediate, Su): When you summon animals that match your animal spirit, they gain a +2 bonus on attack rolls, damage rolls, and saving throws. Wildstrike (Greater, Su): You can allow your animal spirit to gain 1 point of influence over you as a swift action to allow an animal or plant (including your companion) within 30 feet that can see or hear you to immediately take an additional standard action. Wild Heart (Supreme, Ex): You gain a +4 bonus on saves against enchantment and mind-affecting effects, and immunity to effects that affect only humanoids. Once per day, you can cast any summon nature\u0027s ally spell you can cast spontaneously as a standard action without expending a spell slot."
  },
  "effects": [{
    "targetKey": "ability:animal_spirit#druid_supernaturalist",
    "addAction": {
      "numberDelta": 1
    }
  }]
}