{
  "id": "ability:atavistic_avatar#bloodrager_id_rager",
  "name": "Atavistic Avatar",
  "tags": ["class:bloodrager#id_rager", "archetype_feature", "class_feature"],
  "description": {
    "text": "An id rager chooses one emotional focus to define his core: anger, dedication, despair, fear, hatred, jealousy, remorse, or zeal.\nAt 1st level, he gains Skill Focus as a bonus feat in one skill associated with his atavistic focus.\nAnger: Intimidate or Survival. Dedication: Diplomacy or Sense Motive. Despair: Intimidate or Stealth. Fear: Intimidate or Stealth. Hatred: Acrobatics or Perception. Jealousy: Appraise or Bluff. Remorse: Perception or Sense Motive. Zeal: Acrobatics or Survival.\nWhen the id rager enters a bloodrage, he gains additional powers as if he were a phantom with the emotional focus he selected as his atavistic focus. He is considered to be both a phantom and a spiritualist for the purposes of abilities whose effect references both a phantom and a spiritualist, such as a dedication phantom\u0027s dutiful strike, and treats his bloodrager level as both his spiritualist level and his phantom Hit Dice when determining abilities and save DCs.\nThis ability does not allow the id rager to become incorporeal.\nAt 4th level, the id rager gains Lightning Reflexes, Great Fortitude, or Iron Will as a bonus feat.\nAt 8th level, the id rager can meditate for 1 hour to change his atavistic focus for 24 hours or until he decides to return to his permanent atavistic focus as a free action. When he changes his focus, he loses access to his Skill Focus feat and the feat he gained at 4th level, and he wields emotional focus powers as if his spiritualist level and phantom Hit Dice were 3 lower.\nAt 12th level, the id rager gains Skill Focus in both of the skills associated with his atavistic focus. If circumstances cause him to lose one Skill Focus feat, he loses both."
  },
  "effects": [{
    "targetKey": "ability:atavistic_avatar#bloodrager_id_rager",
    "addAction": {
      "numberDelta": 1
    }
  }]
}