{
  "id": 1113212,
  "name": "Lesser (Sealed Summons) Talisman",
  "tags": ["item", "wondrous_item", "neck"],
  "cost": 450.0,
  "weight": 1.0,
  "description": {
    "text": "These amulets are imbued with magic that allows them to protect their wearer against a very specific danger. A talisman triggers automatically as soon as the listed condition is fulfilled. Although talismans occupy the neck slot, up to three talismans can be worn on one cord or chain. Wearing multiple talismans in this way offers a greater variety of protection, but a wearer can benefit from only one talisman\u0027s effect at a time. If another talisman would be triggered while its wearer is under the effect of another talisman, that talisman is not triggered and can still be used later.\nA lesser talisman carries only enough magical energy to protect its wearer once, after which it crumbles to dust.\nAkoben Talisman: This ebony talisman is carved in the shape of a war horn. When the wearer fails a saving throw against a spell or effect that causes him to fall asleep, he immediately receives a second saving throw. If he succeeds at the second saving throw, the horn sounds a loud warning that only the wearer can hear. The wearer becomes deafened and immune to sleep for 1 round as the sound echoes in his mind. Faint abjuration; CL 3rd; alarm, ear-piercing scream.\nAnkh Talisman: This cross has a loop at the top. When a living creature wears it as a talisman, it radiates a soft, golden glow. When the wearer is hit by a creature with the energy drain ability, he receives a saving throw to negate the energy drain, using the DC listed for the ability (which usually determines whether temporary negative levels become permanent). If the creature\u0027s energy drain allows an initial saving throw, the talisman grants a second saving throw if the wearer fails his initial saving throw. If he succeeds at the saving throw granted by the talisman, the talisman releases a blast of force that automatically hits the attacker (as per force punch). Moderate necromancy; CL 7th; death ward, force punch.\nHamsa Talisman: A stern eye adorns the palm of this hand-shaped clay talisman. When the wearer fails a saving throw against a witch\u0027s hex, a spell or spell-like ability with the curse descriptor, or a hag\u0027s supernatural ability, he can attempt a second saving throw. If he succeeds at the second saving throw, the creature that targeted him must succeed at a saving throw using the same DC or suffer the effect. The talisman has no effect on spells and effects that don\u0027t allow a saving throw. Strong abjuration; CL 13th; remove curse, spell turning.\nPentacle Talisman: The five-pointed star carved on this round silver talisman glows blue whenever an evil creature targets the wearer with magic jar, possession, or a similar effect, or with a charm or compulsion spell or effect that allows the creature to exercise control over the wearer (such as suggestion, but not sleep). If the spell or effect allows a saving throw and the wearer fails it, he receives a second saving throw. If he succeeds at the second saving throw, the wearer is also protected by protection from evil for 5 rounds. Faint abjuration; CL 1st; protection from evil.\nScarab Talisman: This amethyst necklace is carved in the shape of a scarab beetle. When the wearer fails a saving throw against a swarm\u0027s poison or distraction ability, he can attempt a second saving throw. If he succeeds at the second saving throw, the wearer becomes immune to the poison and distraction abilities of swarms for 5 rounds. Faint conjuration; CL 3rd; summon swarm.\nTalisman of Arrow Protection: These talismans bear the insignia and name of a martyred saint, who was said to have survived being shot by 99 arrows, only to be slain by the hundredth. The first time that the wearer is hit by two or more ranged attacks in a single round, he is immediately affected by protection from arrows. Faint abjuration; CL 3rd; protection from arrows.\nTalisman of Beneficial Winds: These talismans are inscribed with the secret names of the four winds, and protect the wearer against long falls. The first time that the wearer falls at least 5 feet, he is automatically affected by feather fall. Faint transmutation; CL 1st; feather fall.\nTalisman of Danger Sense: These talismans are inscribed with depictions of predatory animals. The first time the wearer rolls initiative, she is immediately affected by anticipate peril. Faint divination; CL 5th; anticipate peril.\nTalisman of Freedom: These talismans are inscribed with the names of spirits and other figures associated with freedom and liberation. The first time that the wearer becomes grappled, entangled, or paralyzed, he is automatically affected by freedom of movement for 3 rounds. Moderate abjuration; CL 7th; freedom of movement.\nTalisman of Good Fortune: These talismans are inscribed with symbols of good luck, and protect the wearer against bad fortune. The first time that the wearer rolls a natural 1 on a d20 roll (such as on an ability check, attack roll, saving throw, or skill check), he can immediately roll again and take the new result instead. Moderate enchantment; CL 7th; good hope.\nTalisman of Healing Power: These talismans are inscribed with the names and symbols of spirits and other figures associated with healing. The first time that the wearer is reduced to fewer than 1/2 his maximum hit points, he automatically heals 4d8+7 hit points. Moderate conjuration; CL 7th; cure critical wounds.\nTalisman of Life\u0027s Breath: These talismans bear runic symbols of life and vitality, as well as the names of spirits and other figures that are closely associated with life-giving energies. The first time that the wearer dies, he is automatically affected by breath of life. Moderate conjuration; CL 9th; breath of life.\nTalisman of Protection from Flames: These talismans bear symbols of fire and flames, surrounded by circles, triangles, or other shapes to show the flames as being contained. The first time that the wearer takes 5 or more points of fire damage in a single round, he is automatically affected by protection from energy, which protects him from subsequent fire damage. Talismans that protect against other energy types are much less common. Faint abjuration; CL 5th; protection from energy.\nTalisman of Sealed Summons: These talismans bear intricate seals and symbols often used in the binding of outsiders. The first time that the wearer is hit by a natural attack from an evil summoned creature, the wearer is automatically affected by protection from evil. Other versions of this talisman, which affect chaotic, lawful, and good summoned creatures, are much less common. Faint abjuration; CL 1st; protection from evil.\nTalisman of Warrior\u0027s Courage: These talismans bear the names of mighty and fearless warriors and symbols of power and martial prowess. The first time that the wearer would gain the frightened or panicked condition, he gains the shaken condition instead. Faint abjuration; CL 1st; remove fear.\nTriskelion Talisman: This bronze talisman is carved in the shape of three interlocking spirals. When the wearer fails a saving throw against an effect that would cause him to become entangled, paralyzed, or slowed, he receives a second saving throw. If he succeeds at the second saving throw, the wearer instead gains the benefits of longstrider for 5 rounds. Faint transmutation; CL 3rd; longstrider, remove paralysis."
  }
}