{
  "id": "ability:bonded_manifestation",
  "name": "Bonded Manifestation",
  "tags": ["ability", "class_feature", "spiritualist"],
  "maxStacks": 1,
  "description": {
    "text": "At 3rd level, as a swift action, a spiritualist can pull on the consciousness of her phantom and the substance of the Ethereal Plane to partially manifest aspects of both in her own body. When she does, she uses this bonded manifestation to enhance her own abilities while the phantom is still bound to her consciousness.\nFor the spiritualist to use this ability, the phantom must be confined in the spiritualist’s consciousness; it can’t be manifested in any other way.\nDuring a bonded manifestation, the phantom can’t be damaged, dismissed, or banished. A spiritualist can use bonded manifestation a number of rounds per day equal to 3 + her spiritualist level. The rounds need not be consecutive. She can dismiss the effects of a bonded manifestation as a free action, but even if she dismisses a bonded manifestation on the same round that she used it, it counts as 1 round of use.\nWhen a spiritualist uses this ability, she must choose either ectoplasmic or incorporeal form. When she makes this choice, she gains all of the abilities based on the form she chooses and her spiritualist level.\nEctoplasmic Bonded Manifestation: When a spiritualist uses this ability and chooses ectoplasmic form, she gains an ectoplasmic shield that protects her without restricting her movement or actions. She gains a +4 shield bonus to Armor Class; this bonus applies to incorporeal touch attacks. The ectoplasmic shield has no armor check penalty or arcane spell failure chance. At 8th level, the spiritualist also sprouts a pair of ectoplasmic tendrils from her body. Once per round as either a swift or a standard action (spiritualist’s choice), the spiritualist can use one or both tendrils to attack creatures within her melee reach (using the attack bonus and damage dice of her ectoplasmic manifested phantom) or to manipulate objects. She can even use that action to have one tendril make an attack and the other manipulate an object, as long as that object can be manipulated with one hand. At 13th level, the phantom’s ectoplasm clings to the spiritualist like a suit of armor. This grants the spiritualist a +6 armor bonus to AC without imposing an armor check penalty, an arcane spell failure chance, or any reduction in speed. At 18th level, the spiritualist can take a full-round action to attack all creatures within her melee reach with her tendrils (using the attack bonus and damage dice of her ectoplasmic manifested phantom). When she does, she rolls the attack roll twice, takes the better of the two results, and uses that as her attack roll result against all creatures within her melee reach. If the better attack roll threatens a critical hit, the spiritualist chooses one target that she hit to confirm the critical hit against. The other attacks that hit are considered normal hits rather than critical threats.\nIncorporeal Bonded Manifestation: When a spiritualist uses this ability and chooses incorporeal form, she becomes shrouded in a haze of insubstantial mist, granting her concealment against ranged attacks. At 8th level, the spiritualist can better affect incorporeal creatures with melee attacks; her unarmed strikes and melee weapon attacks are treated as if they had the ghost touch magic weapon special ability. At 13th level, the spiritualist can take a standard action to become invisible (as the invisibility spell) until the start of her next turn. At 18th level, the spiritualist gains the incorporeal subtype and a fly speed of 30 feet (good) while using this form of bonded manifestation."
  },
  "stacks": {
    "fixedStack": {
    }
  }
}