{
  "id": "spell:awaken_construct",
  "name": "Awaken Construct",
  "type": "ABILITY_TYPE_SP",
  "school": "transmutation",
  "range": {
    "category": "TOUCH"
  },
  "targets": "mindless construct touched",
  "duration": "instantaneous",
  "description": "You amplify the animating force of a construct to more closely resemble a true soul, granting the construct humanlike sentience. To do so, you must succeed at a Spellcraft check (DC \u003d 15 + the construct\u0027s current Hit Dice). If the construct\u0027s master (if any) is present, this is an opposed Spellcraft check. You have no special empathy or connection with a creature you awaken-it is a free-willed creature. Golems previously under another creature\u0027s control, either as shield guardians or a golem crafter\u0027s creations, break all connections with that creature.  Roll 3d6 to determine the Intelligence score of the awakened construct, and increase its Charisma score by 2d6. It gains feats and skill points according to its new Intelligence score, and the skill points are assigned appropriately for its function, as determined by the GM.  An awakened construct speaks one language that its creator spoke, plus one additional language that its creator knew per point of the construct\u0027s Intelligence bonus (if any). Its alignment is determined by the GM, but is usually within one step of its creator\u0027s alignment. This spell doesn\u0027t function on a construct with an Intelligence score.",
  "level": [{
    "classId": "class:cleric",
    "level": 7
  }, {
    "classId": "class:oracle_7_occultist_5_psychic_6_shaman_6_sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard",
    "level": 7
  }, {
    "classId": "class:cleric",
    "level": 7
  }, {
    "classId": "class:oracle_7_occultist_5_psychic_6_shaman_6_sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard",
    "level": 7
  }, {
    "classId": "class:cleric",
    "level": 7
  }, {
    "classId": "class:oracle_7_occultist_5_psychic_6_shaman_6_sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard",
    "level": 7
  }, {
    "classId": "class:cleric",
    "level": 7
  }, {
    "classId": "class:oracle_7_occultist_5_psychic_6_shaman_6_sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard",
    "level": 7
  }, {
    "classId": "class:cleric",
    "level": 7
  }, {
    "classId": "class:oracle_7_occultist_5_psychic_6_shaman_6_sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard",
    "level": 7
  }]
}