{
  "id": "spell:simulacrum",
  "name": "Simulacrum",
  "type": "ABILITY_TYPE_SP",
  "school": "illusion",
  "range": {
    "feet": 0
  },
  "effect": "one duplicate creature",
  "duration": "instantaneous",
  "description": "Simulacrum creates an illusory duplicate of any creature. The duplicate creature is partially real and formed from ice or snow. It appears to be the same as the original, but it has only half of the real creature\u0027s levels or HD (and the appropriate hit points, feats, skill ranks, and special abilities for a creature of that level or HD).  You can\u0027t create a simulacrum of a creature whose HD or levels exceed twice your caster level. You must make a Disguise check when you cast the spell to determine how good the likeness is.  A creature familiar with the original might detect the ruse with a successful Perception check (opposed by the caster\u0027s Disguise check) or a DC 20 Sense Motive check.  At all times, the simulacrum remains under your absolute command. No special telepathic link exists, so command must be exercised in some other manner. A simulacrum has no ability to become more powerful. It cannot increase its level or abilities. If reduced to 0 hit points or otherwise destroyed, it reverts to snow and melts instantly into nothingness. A complex process requiring at least 24 hours, 100 gp per hit point, and a fully equipped magical laboratory can repair damage to a simulacrum.",
  "level": [{
    "classId": "class:sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard_7_summoner",
    "level": 7
  }, {
    "classId": "class:unchained_summoner_5_psychic",
    "level": 7
  }, {
    "classId": "class:sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard_7_summoner",
    "level": 7
  }, {
    "classId": "class:unchained_summoner_5_psychic",
    "level": 7
  }, {
    "classId": "class:sorcerer",
    "level": 7
  }, {
    "classId": "class:wizard_7_summoner",
    "level": 7
  }, {
    "classId": "class:unchained_summoner_5_psychic",
    "level": 7
  }]
}