{
  "id": "ability:shadow_double#slayer_ankous_shadow",
  "name": "Shadow Double",
  "tags": ["archetype_feature", "class_feature"],
  "description": {
    "text": "An ankou\u0027s shadow can take a full-round action to create a single, quasi-real, shadowy duplicate. This shadow double remains in his square, mimicking his movements as a single mirror image, except that it lasts until it is destroyed or he chooses to dismiss it as a swift action. This ability does not stack with the mirror image spell or with similar abilities, such as the copycat ability of the Trickery domain.\nAt 5th level, an ankou\u0027s shadow gains a second shadow double. In addition to using these shadow doubles as mirror images in his square, he can move his doubles as part of his own move action, dividing his movement between himself and his doubles. When outside his square, shadow doubles do not protect the ankou\u0027s shadow as mirror image and are limited in the actions they can take. Shadow doubles provide flanking for the ankou\u0027s shadow and his allies, but they do not possess teamwork feats or special abilities that alter the effects of flanking or aiding another. As a swift action, the ankou\u0027s shadow can direct his shadow doubles to use the aid another action, using his own base attack bonus plus his Intelligence modifier for the roll. Although a shadow double appears to duplicate the ankou\u0027s shadow\u0027s gear, this gear is part of its form; a shadow double\u0027s gear cannot be destroyed, dropped, or stolen. A shadow double disappears if it ventures more than 50 feet from the ankou\u0027s shadow or if it leaves his line of sight or effect. A shadow double that is hit by an attack roll or takes any damage is destroyed. The AC of a shadow double is equal to the ankou\u0027s shadow\u0027s touch AC, and it has the same CMD and saving throw bonuses as the ankou\u0027s shadow. Shadow doubles possess evasion if the ankou\u0027s shadow does. Mind-affecting effects targeting a shadow double affect the ankou\u0027s shadow instead, though he isn\u0027t affected twice by effects that target both him and a shadow double.\nAt 10th level, an ankou\u0027s shadow gains a third shadow double. He can divide his actions between his actual body and his shadow doubles, using them as the origin point for attacks or abilities. For example, an ankou\u0027s shadow making three attacks as a part of a full attack could make his primary attack from his own body and his other two attacks from two of his shadow doubles.\nAt 15th level, an ankou\u0027s shadow gains a fourth shadow double. In addition to the abilities above, an ankou\u0027s shadow can assign the doubles to perform simple tasks on their own, as the unseen servant spell, except that the shadow doubles have an effective Strength score of 10."
  },
  "effects": [{
    "targetKey": "ability:shadow_double#slayer_ankous_shadow",
    "addAction": {
      "numberDelta": 1
    }
  }]
}