{
  "id": "ability:pathfinders_past#shaman_name_keeper",
  "name": "Pathfinders Past",
  "tags": ["archetype_feature", "class_feature"],
  "description": {
    "text": "At 4th level, a name-keeper can form a temporary bond with a deceased person. The name-keeper must make this selection each day when preparing her spells. While this feature is active, she gains one or more benefits. Each allows her to select one or more options (such as a weapon or shaman spirit), and she can choose different options each time she forms this bond.\nScrolls: The name-keeper selects an oracle mystery. She can use any of the mystery\u0027s associated skills untrained, and she treats them as class skills. For any of those skills that were already class skills, she instead gains a +2 sacred bonus on those checks. At 12th level, she gains Skill Focus for one of the associated skills as a bonus feat. At 20th level, she gains Skill Focus a second time as a bonus feat, and she always counts as having at least 10 ranks in those skills for calculating these temporary feats\u0027 benefits.\nSpells: The name-keeper selects a second shaman spirit and adds the spells granted by that spirit to her list of spells that she can cast using spirit magic. She gains one additional spirit magic spell slot of her highest spell level. At 12th level, she selects two shaman spirits and adds both their granted spells to the list of spells she can cast using spirit magic. At 20th level, her number of spirit magic spell slots at each spell level increases to two.\nSwords: The name-keeper gains proficiency in all martial weapons and one exotic weapon of her choice. At 12th level, whenever she makes a full attack, she gains one additional attack at her highest base attack bonus; this ability stacks with the extra attack from haste, but it doesn\u0027t stack with other abilities that grant extra attacks. At 20th level, she gains two combat feats for which she qualifies."
  },
  "effects": [{
    "targetKey": "ability:pathfinders_past#shaman_name_keeper",
    "addAction": {
      "numberDelta": 1
    }
  }]
}