{
  "id": "ability:symbiosis#witch_synergist",
  "name": "Symbiosis",
  "tags": ["archetype_feature", "class_feature"],
  "description": {
    "text": "At 1st level, a synergist gains the ability to meld or unmeld with her familiar as a standard action. While the familiar is melded, its body becomes part of the synergist\u0027s and can\u0027t be targeted or affected by any means (including ongoing effects), though the familiar can still communicate its feelings empathically. The symbiosis causes the synergist to adopt some basic physical features of the familiar and grants additional abilities based on the synergist\u0027s level.\nAt 1st level, during symbiosis the synergist gains darkvision or low-light vision if the familiar possesses it.\nAt 5th level, during symbiosis the synergist gains any abilities the familiar possesses that are listed under beast shape I, except flight.\nAt 8th level, during symbiosis the synergist gains any abilities the familiar possesses that are listed under beast shape II. If the familiar can fly, the synergist can fly for a total of 1 minute per witch level she possesses per day while in symbiosis. This duration need not be consecutive, but it must be spent in 1-minute intervals.\nAdditionally, during symbiosis the synergist gains a single natural attack of a type possessed by its familiar.\nThe attack deals 1d6 points of damage if a primary attack (1d6 for Small synergists) and 1d4 points of damage if a secondary attack (1d3 for Small synergists).\nAt 11th level, during symbiosis the synergist gains any abilities the familiar possesses that are listed under beast shape III. If the familiar can fly, the synergist can fly for an unlimited amount of time each day while in symbiosis.\nAt 14th level, during symbiosis the synergist gains any abilities the familiar possesses that are listed under beast shape IV. If the familiar has multiple natural attacks, the synergist gains them all, rather than just one."
  },
  "effects": [{
    "targetKey": "ability:symbiosis#witch_synergist",
    "addAction": {
      "numberDelta": 1
    }
  }]
}