{
  "id": "ability:plague_vial#alchemist_plague_bringer",
  "name": "Plague Vial",
  "tags": ["archetype_feature", "class_feature"],
  "description": {
    "text": "At 1st level, a plague bringer can create a plague vial, an alchemically grown and concentrated disease sample. It takes 1 hour to prepare a plague vial, and once prepared, the vial remains potent until used. A plague bringer can only maintain 1 plague vial at a time--if he prepares a second vial, any existing plague vial becomes inert. A plague vial that is not in a plague bringer\u0027s possession becomes inert until a plague bringer picks it up again.\nIt\u0027s a standard action to drink a plague vial. Upon being imbibed, the plague vial infects the plague bringer\u0027s blood, sweat, tears, and other bodily fluids for 10 minutes per class level. Any creature that harms him with melee attacks (except with reach weapons) must make a Fortitude save (DC 10 + 1/2 the plague bringer\u0027s level + the plague bringer\u0027s Intelligence modifier) or become sickened for 1 round per plague bringer level. The plague bringer is immune to the effect of his own plague vial, but not that of another\u0027s plague vial. The effects of multiple plague vials do not stack.\nAs a standard action, the plague bringer can infect a weapon with this sickness (typically by licking it or wiping his blood or pus on it). The disease on the weapon works like a poisoned weapon, except the source is a disease instead of a poison (so a dwarf\u0027s resistance to poison does not apply).\nAnyone other than a plague bringer (including another alchemist) who drinks a plague vial must make a saving throw against the vial\u0027s DC or become nauseated for 1 hour. Unless he learns how to brew a mutagen by taking the mutagen discovery , he can never benefit from a mutagen and reacts to it as if he were a non-alchemist. At any particular time, a plague bringer can only be under the effect of either a plague vial or a mutagen (not both); drinking another immediately ends the effects of any ongoing plague vial or mutagen.\nAll limitations to mutagens apply to plague vials as if they were the same substance. The infuse mutagen discovery and persistent mutagen class ability apply to plague vials. The sticky poison discovery applies to a weapon infected with a plague vial. The plague vial is a disease effect."
  },
  "effects": [{
    "targetKey": "ability:plague_vial#alchemist_plague_bringer",
    "addAction": {
      "numberDelta": 1
    }
  }]
}