{
  "id": "ability:fused_eidolon#summoner_synthesist",
  "name": "Fused Eidolon",
  "tags": ["archetype_feature", "class_feature"],
  "description": {
    "text": "A synthesist summons the essence of a powerful outsider to meld with his own being. The synthesist wears the eidolon like translucent, living armor. The eidolon mimics all of the synthesist\u0027s movements, and the synthesist perceives through the eidolon\u0027s senses and speaks through its voice, as the two are now one creature.\nWhile fused with his eidolon, the synthesist uses the eidolon\u0027s physical ability scores (Strength, Dexterity, and Constitution), but retains his own mental ability scores (Intelligence, Wisdom, and Charisma). The synthesist gains the eidolon\u0027s hit points as temporary hit points. When these hit points reach 0, the eidolon is killed and sent back to its home plane. The synthesist uses the eidolon\u0027s base attack bonus, and gains the eidolon\u0027s armor and natural armor bonuses and modifiers to ability scores. The synthesist also gains access to the eidolon\u0027s special abilities and the eidolon\u0027s evolutions. The synthesist is still limited to the eidolon\u0027s maximum number of natural attacks. The eidolon has no skills or feats of its own. The eidolon must be at least the same size as the synthesist. The eidolon must have limbs for the synthesist to cast spells with somatic components. The eidolon\u0027s temporary hit points can be restored with the rejuvenate eidolon spell.\nWhile fused, the synthesist loses the benefits of his armor. He counts as both his original type and as an outsider for any effect related to type, whichever is worse for the synthesist. Spells such as banishment or dismissal work normally on the eidolon, but the synthesist is unaffected. Neither the synthesist nor his eidolon can be targeted separately, as they are fused into one creature. The synthesist and eidolon cannot take separate actions. While fused with his eidolon, the synthesist can use all of his own abilities and gear, except for his armor. In all other cases, this ability functions as the summoner\u0027s normal eidolon ability (for example, the synthesist cannot use his summon monster ability while the eidolon is present).\nThis ability replaces the class\u0027s eidolon ability, bond senses, and life bond.\nThe following class abilities function differently for synthesist summoners."
  },
  "effects": [{
    "targetKey": "ability:fused_eidolon#summoner_synthesist",
    "addAction": {
      "numberDelta": 1
    }
  }]
}