{
  "id": "ability:divine_bond#paladin",
  "name": "Divine Bond",
  "tags": ["ability", "class_feature", "paladin"],
  "maxStacks": 1,
  "description": {
    "text": "Upon reaching 5th level, a paladin forms a divine bond with her god. This bond can take one of two forms. Once the form is chosen, it cannot be changed.The first type of bond allows the paladin to enhance her weapon as a standard action by calling upon the aid of a celestial spirit for 1 minute per paladin level. When called, the spirit causes the weapon to shed light as a torch. At 5th level, this spirit grants the weapon a +1 enhancement bonus. For every three levels beyond 5th, the weapon gains another +1 enhancement bonus, to a maximum of +6 at 20th level. These bonuses can be added to the weapon, stacking with existing weapon bonuses to a maximum of +5, or they can be used to add any of the following weapon properties: axiomatic, brilliant energy, defending, disruption, flaming, flaming burst, holy, keen, merciful, and speed. Adding these properties consumes an amount of bonus equal to the property\u0027s cost (see Table: Melee Weapon Special Abilities). These bonuses are added to any properties the weapon already has, but duplicate abilities do not stack. If the weapon is not magical, at least a +1 enhancement bonus must be added before any other properties can be added. The bonus and properties granted by the spirit are determined when the spirit is called and cannot be changed until the spirit is called again. The celestial spirit imparts no bonuses if the weapon is held by anyone other than the paladin but resumes giving bonuses if returned to the paladin. These bonuses apply to only one end of a double weapon. A paladin can use this ability once per day at 5th level, and one additional time per day for every four levels beyond 5th, to a total of four times per day at 17th level.If a weapon bonded with a celestial spirit is destroyed, the paladin loses the use of this ability for 30 days, or until she gains a level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls.The second type of bond allows a paladin to gain the service of an unusually intelligent, strong, and loyal steed to serve her in her crusade against evil. This mount is usually a heavy horse (for a Medium paladin) or a pony (for a Small paladin), although more exotic mounts, such as a boar, camel, or dog are also suitable. This mount functions as a druid\u0027s animal companion, using the paladin\u0027s level as her effective druid level. Bonded mounts have an Intelligence of at least 6.In addition to horses, a paladin may select (at the GM\u0027s discretion) some less ordinary creatures.A Medium paladin can select an elkPPC:WO, giant seahorsePPC:WO, giraffePPC:WO, yakPZO1140 or zebraPZO1140 as a bonded mount.A Small paladin can select an antelopePPC:WO, capybaraPZO1140, eohippusPZO1140, giant weaselPPC:WO, ramPPC:WO, reindeerPZO1140, stagPPC:WO, or wolfdogPZO1140 as a bonded mount.The auspice, bodyguard, racer, and totem guide archetypes are all particularly appropriate for a paladin\u0027s bonded mount.Once per day, as a full-round action, a paladin may magically call her mount to her side. This ability is the equivalent of a spell of a level equal to one-third the paladin\u0027s level. The mount immediately appears adjacent to the paladin. A paladin can use this ability once per day at 5th level, and one additional time per day for every 4 levels thereafter, for a total of four times per day at 17th level.At 11th level, the mount gains the celestial creature simple template and becomes a magical beast for the purposes of determining which spells affect it.At 15th level, a paladin\u0027s mount gains spell resistance equal to the paladin\u0027s level + 11.Should the paladin\u0027s mount die, the paladin may not summon another mount for 30 days or until she gains a paladin level, whichever comes first. During this 30-day period, the paladin takes a –1 penalty on attack and weapon damage rolls."
  },
  "stacks": {
    "fixedStack": {
      "stacks": [{
        "choices": [{
          "choiceId": "divine_bond",
          "label": "Divine Bond",
          "tags": ["divine_bond"],
          "repeating": {
            "none": {
            }
          },
          "featureSelect": {
            "optionTags": ["paladin+divine_bond"]
          }
        }]
      }]
    }
  }
}